{
  "track_id": "Drei_Nüsse_-_patrouille",
  "provenance": {
    "original_audio_path": "../../jamando_processed/transcoded/Drei_Nüsse_-_patrouille.wav",
    "original_lyrics_path": "../../data/raw/jam-alt/lyrics/Drei_Nüsse_-_patrouille.txt",
    "processing_date": "2025-10-24T22:01:18.248988+00:00",
    "script_version": "1.0.0"
  },
  "audio_properties": {
    "original_sr": 22050,
    "target_sr": 44100,
    "channels": 1
  },
  "audio_features": {
    "duration_seconds": 259.1302947845805,
    "integrated_loudness_lufs": -11.863389249843268,
    "snr_percentile_db": 8.579926527208904,
    "clipping_percentage": 0.0,
    "rms_energy_mean": 0.07598114758729935,
    "rms_energy_std": 0.018005525693297386,
    "zcr_mean": 0.04341183460741487,
    "zcr_std": 0.03470972425677605,
    "spectral_centroid_mean": 1899.40160205441,
    "spectral_bandwidth_mean": 2285.1999396234114,
    "mfcc_0_mean": -249.07423625795454,
    "mfcc_0_std": 41.579650800056974,
    "mfcc_1_mean": 190.48318799249273,
    "mfcc_1_std": 25.37808947648315,
    "mfcc_2_mean": -40.27432180912065,
    "mfcc_2_std": 14.609994829168217,
    "mfcc_3_mean": 55.93454270104779,
    "mfcc_3_std": 23.712809354702237,
    "mfcc_4_mean": -6.725361668592502,
    "mfcc_4_std": 20.03039930336604,
    "mfcc_5_mean": 16.089569354256366,
    "mfcc_5_std": 15.789363253329004,
    "mfcc_6_mean": 5.141244425758597,
    "mfcc_6_std": 8.879939399691922,
    "mfcc_7_mean": -10.768126079914248,
    "mfcc_7_std": 10.359638467400783,
    "mfcc_8_mean": 15.96899509281744,
    "mfcc_8_std": 11.61706233986789,
    "mfcc_9_mean": -13.164774171928466,
    "mfcc_9_std": 9.397230229626594,
    "mfcc_10_mean": 7.8968339583751765,
    "mfcc_10_std": 8.742729888950556,
    "mfcc_11_mean": -2.9418184305245942,
    "mfcc_11_std": 7.4838921229047255,
    "mfcc_12_mean": -1.6684939558594496,
    "mfcc_12_std": 6.773275293068332,
    "vocal_dominance_score_hpss": 0.8611087003032649
  },
  "lyrics_features": {
    "cleaned_text": "Komm her, komm her, komm her zu mir Du hast drei Wünsche frei, komm und sag, was wünschst du dir? Komm her, komm her, komm her, mein Kind Ich hab' für dich drei Nüsse, die für deine Wünsche sind Drei Nüsse, das ist cool, Mann, wie im Film vom Aschenbrödel Endlich Schluss mit all den Sorgen von gestern Heute und morgen geht nur noch die Party ab, her mit den Nüssen Ich geh ins KDW zum Shoppen Korken knallen, Hüllen fallen, und die Popkörner poppen Nie wieder das Gerödel und nie wieder Füße küssen Meine Eier muss ich nicht mehr bei der Nachbarin ausborgen Ich nehm Geld, Auto, Yacht, 'n paar von den krassesten Schnitten Du weißt, die echten Luxusteile mit den monstergroßen Augen Und die andern sollen sich meine Tracks aus dem Netz runtersaugen Ich sag an, was geht und muss nicht mehr um Anerkennung bitten Komm her, komm her, komm her zu mir Du hast drei Wünsche frei, komm und sag, was wünschst du dir? Komm her, komm her, komm her mein Kind Ich hab' für dich drei Nüsse, die für deine Wünsche sind Okay, das war 'n bisschen viel Ich nehm' nur Cash, die anderen Sachen kann ich kaufen Obwohl dann würd' ich nicht in der Rotation laufen Wunsch Nummer zwei ist also ein fetter Hit, aber nein Da fällt mir ein gedopter Erfolg kann nicht befriedigend sein Okay, also was ist mit den Weibern? Ich als Hahn im Korb, voll mit gepiercten Leibern Ist das wirklich geil? Mechanischer Sex und von keiner geliebt? Und keine, die auf mich von Herzen auch nur zehn Cent gibt Das ist doch Scheisse, Mann, ich bin nicht wie die leitenden Reichen Auf ihren riesigen Booten Die sich Liebe kaufen, die seelisch Toten Wer steht schon auf den Sex und Style der reitenden Leichen? Komm her, komm her, komm her zu mir Du hast drei Wünsche frei, komm und sag, was wünschst du dir? Komm her, komm her, komm her, mein Kind Ich hab' für dich drei Nüsse, die für deine Wünsche sind Und überhaupt, es wär' doch traurig auf der Yacht rumzulungern Während anderswo die Menschen verhungern Die jeden Tag die Hummerstückchen aus der Schale zu nagen Wenn nebenan die Raketen in Wohnzimmern einschlagen Also bleibt nur das Auto, aber könnte ein Leben sinnloser sein? Da kommt 'ne Fee, du hast drei Wünsche frei und dir fällt nur Auto ein? Für die wichtigen Dinge, Liebe, Glück und Respekt Reicht kein frommer Wunsch, das hab' ich gecheckt Du gehst mir voll auf die Nüsse, Fee, keiner hat dich hier vermisst Also pack deine scheiß Nüsse ein, verpiss dich, you are dismissed! Komm her, komm her, komm her zu mir Du hast drei Wünsche frei, komm und sag, was wünschst du dir? Komm her, komm her, komm her, mein Kind Ich hab' für dich drei Nüsse, die für deine Wünsche sind Komm her, komm her, komm her zu mir Du hast drei Wünsche frei, komm und sag, was wünschst du dir? Komm her, komm her, komm her, mein Kind Ich hab' für dich drei Nüsse, die für deine Wünsche sind",
    "language_code": "de",
    "completeness_heuristic": 1.0,
    "word_count": 518,
    "char_count": 2837,
    "sentence_count": 13,
    "type_token_ratio": 0.4613899613899614
  },
  "is_high_quality": false,
  "normalized_audio_path": "processed_dataset/jam-alt/audio_rejected/Drei_Nüsse_-_patrouille.wav"
}