{
  "track_id": "039",
  "provenance": {
    "original_audio_path": "../../data/raw/MIREX-like_mood/dataset/Audio/039.mp3",
    "original_lyrics_path": "../../data/raw/MIREX-like_mood/dataset/Lyrics/039.txt",
    "processing_date": "2025-10-24T22:16:43.856445+00:00",
    "script_version": "1.0.0"
  },
  "audio_properties": {
    "original_sr": 44100,
    "target_sr": 44100,
    "channels": 2
  },
  "audio_features": {
    "duration_seconds": 4.5351473922902495e-05,
    "integrated_loudness_lufs": -Infinity,
    "snr_percentile_db": 13.852380752563477,
    "clipping_percentage": 0.0,
    "rms_energy_mean": 7.446770950991777e-07,
    "rms_energy_std": 0.0,
    "zcr_mean": 0.00048828125,
    "zcr_std": 0.0,
    "spectral_centroid_mean": 11919.71704389698,
    "spectral_bandwidth_mean": 6288.536291779583,
    "mfcc_0_mean": -1131.370849609375,
    "mfcc_0_std": 0.0,
    "mfcc_1_mean": 0.0,
    "mfcc_1_std": 0.0,
    "mfcc_2_mean": 0.0,
    "mfcc_2_std": 0.0,
    "mfcc_3_mean": 0.0,
    "mfcc_3_std": 0.0,
    "mfcc_4_mean": 0.0,
    "mfcc_4_std": 0.0,
    "mfcc_5_mean": 0.0,
    "mfcc_5_std": 0.0,
    "mfcc_6_mean": 0.0,
    "mfcc_6_std": 0.0,
    "mfcc_7_mean": 0.0,
    "mfcc_7_std": 0.0,
    "mfcc_8_mean": 0.0,
    "mfcc_8_std": 0.0,
    "mfcc_9_mean": 0.0,
    "mfcc_9_std": 0.0,
    "mfcc_10_mean": 0.0,
    "mfcc_10_std": 0.0,
    "mfcc_11_mean": 0.0,
    "mfcc_11_std": 0.0,
    "mfcc_12_mean": 0.0,
    "mfcc_12_std": 0.0,
    "vocal_dominance_score_hpss": 0.5000001192092896
  },
  "lyrics_features": {
    "cleaned_text": "(Hey, Hey) yeah Bye, Bye, Bye Bye, Bye... Bye, Bye... Oh, Oh, Oh..love .. Hi, I'm doin' this tonight, You're probably gonna start a fight. I know this can't be right. Hey baby come on, I loved you endlessly, When you weren't there for me. So now it's time to leave and make it alone I know that I can't take no more It ain't no lie I wanna see you out that door Baby, bye, bye, bye... Bye Bye Don't wanna be a fool for you Just another player in your game for two You may hate me but it ain't no lie, Baby, bye, bye, bye... Bye Bye Don't really wanna make it tough, I just wanna tell you that I had enough. It might sound crazy, But it ain't no lie, Baby, bye, bye, bye (Oh, Oh, Oh) Hmm, just hit me with the truth, Now, girl you're more than welcome to. So give me one good reason, Baby come on I live for you and me, And now I really come to see, That life would be much better once you're gone. I know that I can't take no more It ain't no lie, I wanna see you out that door Baby, bye, bye, bye... Bye Bye Don't wanna be a fool for you Just another player in your game for two You may hate me but it ain't no lie, Baby Bye, bye, bye... Bye Bye Don't really wanna make it tough, I just wanna tell you that I had enough (ooh ooh) It might sound crazy, But it ain't no lie, Baby, bye, bye, bye I'm giving up I know for sure I don't wanna be the reason for your love no more Bye Bye I'm checkin' out I'm signin' off I don't wanna be the loser and I've had enough I don't wanna be your fool In this game for two So I'm leavin' you behind Bye, bye, bye... I don't wanna make it tough (make it tough) But I had enough And it ain't no lie (Bye, bye baby...) Bye, Bye Don't wanna be a fool for you Just another player in your game for two (I don't wanna be your fool) But it ain't no lie Baby bye, bye, bye... Don't really wanna make it tough (I don't wanna make it tough), I just wanna tell you that I had enough (that I had enough). Might sound crazy, But it ain't no lie, Bye, bye, bye Bye bye",
    "language_code": "en",
    "completeness_heuristic": 0.8,
    "word_count": 417,
    "char_count": 1990,
    "sentence_count": 19,
    "type_token_ratio": 0.34772182254196643
  },
  "is_high_quality": true,
  "normalized_audio_path": "processed_dataset/MOOD/audio_normalized/039.wav"
}