{
  "track_id": "068",
  "provenance": {
    "original_audio_path": "../../data/raw/MIREX-like_mood/dataset/Audio/068.mp3",
    "original_lyrics_path": "../../data/raw/MIREX-like_mood/dataset/Lyrics/068.txt",
    "processing_date": "2025-10-24T22:16:39.015797+00:00",
    "script_version": "1.0.0"
  },
  "audio_properties": {
    "original_sr": 44100,
    "target_sr": 44100,
    "channels": 2
  },
  "audio_features": {
    "duration_seconds": 4.5351473922902495e-05,
    "integrated_loudness_lufs": -Infinity,
    "snr_percentile_db": 1.3658511638641357,
    "clipping_percentage": 0.0,
    "rms_energy_mean": 1.2511060958786402e-05,
    "rms_energy_std": 0.0,
    "zcr_mean": 0.0,
    "zcr_std": 0.0,
    "spectral_centroid_mean": 8120.724299849604,
    "spectral_bandwidth_mean": 5385.089289646516,
    "mfcc_0_mean": -871.5099487304688,
    "mfcc_0_std": 0.0,
    "mfcc_1_mean": 25.00271987915039,
    "mfcc_1_std": 0.0,
    "mfcc_2_mean": -19.7342586517334,
    "mfcc_2_std": 0.0,
    "mfcc_3_mean": 14.990216255187988,
    "mfcc_3_std": 0.0,
    "mfcc_4_mean": -11.694819450378418,
    "mfcc_4_std": 0.0,
    "mfcc_5_mean": 9.293882369995117,
    "mfcc_5_std": 0.0,
    "mfcc_6_mean": -7.643543243408203,
    "mfcc_6_std": 0.0,
    "mfcc_7_mean": 6.3331451416015625,
    "mfcc_7_std": 0.0,
    "mfcc_8_mean": -5.431390762329102,
    "mfcc_8_std": 0.0,
    "mfcc_9_mean": 4.608819007873535,
    "mfcc_9_std": 0.0,
    "mfcc_10_mean": -4.074675559997559,
    "mfcc_10_std": 0.0,
    "mfcc_11_mean": 3.5100317001342773,
    "mfcc_11_std": 0.0,
    "mfcc_12_mean": -3.170742988586426,
    "mfcc_12_std": 0.0,
    "vocal_dominance_score_hpss": 0.5
  },
  "lyrics_features": {
    "cleaned_text": "Uh, uh Yo, yo, yo They wanna know Who's that girl? (La, la, la, la, la, la, la, la, la, la, la) Eve's that girl (La, la, la, la, la, la, la, la, la, la, la) Who's that girl? (La, la, la, la, la, la, la, la, la, la, la) Eve's that girl (La, la, la, la, la, la, la, la, la, la, la) Can I turn you on by my word's spell? Look into my eyes think I want you, can't tell Me, I keep it sexy, daddy so I can't fail Keep it gangsta for the cowards so I give 'em hell Call me misfit, lips spit a gang of trash Wrist glist now cause I make a gang of cash Light glance, still street with the do-rag Slang, spit game, change speech, how they do that? Watch they mouths drop, watch the crowds pop up and act out Broads with the screw face, smash on and knock out Ain't changed game game around me, I run the game If I gotta keep it gritty so be it, I'm supposed to change Like simple, dizzy broads ain't fuckin' with my mental Natural born hustlin' bitch check what I've been through Got mine took it from you, and now you slot mine Exec to my own shit, dawg I ownin' dot coms' Who's that girl? (La, la, la, la, la, la, la, la, la, la, la) Eve's that girl (La, la, la, la, la, la, la, la, la, la, la) Who's that girl? (La, la, la, la, la, la, la, la, la, la, la) Eve's that girl (La, la, la, la, la, la, la, la, la, la, la) (Yo, yo) I can understand why you're scared of Eve Thought I did it one way, ain't prepared for me Huh, mad cause an image I don't care to be Realness, real shit, spit reality Attitude rude, that's the Philly in I Need me in the game, I'm the thrill in your life Breath of fresh air Little boys hang me on their wall, I grow 'em chest hair Why you listenin to other shit? You go the best here Come on try your luck shorty, I got the rest scared Bet you anything you aint ready and you get left there Ain't known for frontin' vouch for my behavior, Same way they get down, I get down for this paper Sixteen lean from my pence so you can test her Still need to know who I am then cop the record Take it like a class on me and learn the lesson Bottom line my world, my way any questions? Who's that girl? (La, la, la, la, la, la, la, la, la, la, la) Eve's that girl (La, la, la, la, la, la, la, la, la, la, la) Who's that girl? (La, la, la, la, la, la, la, la, la, la, la) Eve's that girl (La, la, la, la, la, la, la, la, la, la, la) (Uh, yo) Power moves is made everyday by this thorough bitch I'mma get this bank anyway that I do this shit I was born to shine while most of y'all was borderline bullshit Know exactly what I want from me, you cats is clueless, Dispose the flow through my hands like water Heat starts growing from my son or my daughter Eve want her own cash, fuck what you bought her He spend, you owe, that's what mommy taught her All ball is played, won't starve today Song after song I write so I get paid Thought I wasn't followin' up with the second round Now bitch swallow it up while I shuv it down Make em love me over again and over your name Betcha they get over your style and over your fame Why you lookin' sad at me, I ain't the blame Back to plan B baby I can feel your pain Who's that girl? (La, la, la, la, la, la, la, la, la, la, la) Eve's that girl (La, la, la, la, la, la, la, la, la, la, la) Who's that girl? (La, la, la, la, la, la, la, la, la, la, la) Eve's that girl (La, la, la, la, la, la, la, la, la, la, la)",
    "language_code": "en",
    "completeness_heuristic": 1.0,
    "word_count": 707,
    "char_count": 3359,
    "sentence_count": 13,
    "type_token_ratio": 0.4328147100424328
  },
  "is_high_quality": false,
  "normalized_audio_path": "processed_dataset/MOOD/audio_rejected/068.wav"
}