{
  "track_id": "218",
  "provenance": {
    "original_audio_path": "../../data/raw/MIREX-like_mood/dataset/Audio/218.mp3",
    "original_lyrics_path": "../../data/raw/MIREX-like_mood/dataset/Lyrics/218.txt",
    "processing_date": "2025-10-24T22:16:43.478928+00:00",
    "script_version": "1.0.0"
  },
  "audio_properties": {
    "original_sr": 44100,
    "target_sr": 44100,
    "channels": 2
  },
  "audio_features": {
    "duration_seconds": 4.5351473922902495e-05,
    "integrated_loudness_lufs": -Infinity,
    "snr_percentile_db": 1.6301484107971191,
    "clipping_percentage": 0.0,
    "rms_energy_mean": 0.0001468774862587452,
    "rms_energy_std": 0.0,
    "zcr_mean": 0.0,
    "zcr_std": 0.0,
    "spectral_centroid_mean": 8158.195749838287,
    "spectral_bandwidth_mean": 5415.305209838351,
    "mfcc_0_mean": -629.2981567382812,
    "mfcc_0_std": 0.0,
    "mfcc_1_mean": 24.585704803466797,
    "mfcc_1_std": 0.0,
    "mfcc_2_mean": -19.338314056396484,
    "mfcc_2_std": 0.0,
    "mfcc_3_mean": 14.616520881652832,
    "mfcc_3_std": 0.0,
    "mfcc_4_mean": -11.341802597045898,
    "mfcc_4_std": 0.0,
    "mfcc_5_mean": 8.959632873535156,
    "mfcc_5_std": 0.0,
    "mfcc_6_mean": -7.326541423797607,
    "mfcc_6_std": 0.0,
    "mfcc_7_mean": 6.032076358795166,
    "mfcc_7_std": 0.0,
    "mfcc_8_mean": -5.145096778869629,
    "mfcc_8_std": 0.0,
    "mfcc_9_mean": 4.336329460144043,
    "mfcc_9_std": 0.0,
    "mfcc_10_mean": -3.8151068687438965,
    "mfcc_10_std": 0.0,
    "mfcc_11_mean": 3.262575387954712,
    "mfcc_11_std": 0.0,
    "mfcc_12_mean": -2.9346909523010254,
    "mfcc_12_std": 0.0,
    "vocal_dominance_score_hpss": 0.5000000596046448
  },
  "lyrics_features": {
    "cleaned_text": "Hey baby, just remember I'm forever your girl. Baby, forever, and ever and ever, you know I am. Baby, pick your head up, (head up) come on and look me in the face, 'cause I can tell that something is bringin' you down. (Why are you down?) Is it the rumor that another boy wants to take your place? (I hear he's after your heart.) Have you been hearin' the stories? They're goin' around. (All of my friends are talkin'.) Baby, just remember I gave you my heart, ain't no-one gonna tear us apart. He can promise the moon and the stars above, even if he promised me the world; Just remember I'm forever your girl. He could promise the world. Just remember, I'm forever your girl. Honey, listen to me, Your love is all I need. You should know that I don't need nothin' That money can buy. So if a boy were to come along And try to make me leave you, (Girl, I'd go out of my mind.) There'd be no reason to worry, I'm tellin' you why. (I need to hear that you really love me.) Baby, don't you know that I love you, And I'd never put nobody above you. He could promise the moon and the stars above, Even if he promised me the world. Just remember I'm forever your girl. He could promise the world. Just remember, I'm forever your girl. I'm forever your baby. Just remember I'm forever your girl. He could promise the world. Just remember, I'm forever your girl. When the mountains crumble in to the sea, that's the day someone will come between you and me. Baby, just remember I gave you my heart, ain't no-one gonna tear us apart. Baby, he could promise me diamonds, even in he promised me pearls; honey, you know I ain't lyin', listen as I tell it to the world. Just remember I'm forever your girl. He could promise the world. Just remember, I'm forever your girl. Girl you know I love you, And I always will. If we live till forever, I'll be lovin' you still. just remember I'm forever your girl. He could promise the world. Just remember, I'm forever your girl. I'm forever your baby, I'm forever your girl. I'm forever your baby, I'm forever your girl.",
    "language_code": "en",
    "completeness_heuristic": 1.0,
    "word_count": 387,
    "char_count": 2050,
    "sentence_count": 41,
    "type_token_ratio": 0.4082687338501292
  },
  "is_high_quality": false,
  "normalized_audio_path": "processed_dataset/MOOD/audio_rejected/218.wav"
}