{
  "track_id": "317",
  "provenance": {
    "original_audio_path": "../../data/raw/MIREX-like_mood/dataset/Audio/317.mp3",
    "original_lyrics_path": "../../data/raw/MIREX-like_mood/dataset/Lyrics/317.txt",
    "processing_date": "2025-10-24T22:16:37.273518+00:00",
    "script_version": "1.0.0"
  },
  "audio_properties": {
    "original_sr": 44100,
    "target_sr": 44100,
    "channels": 2
  },
  "audio_features": {
    "duration_seconds": 4.5351473922902495e-05,
    "integrated_loudness_lufs": -Infinity,
    "snr_percentile_db": 4.419729709625244,
    "clipping_percentage": 0.0,
    "rms_energy_mean": 2.369424919379526e-06,
    "rms_energy_std": 0.0,
    "zcr_mean": 0.0,
    "zcr_std": 0.0,
    "spectral_centroid_mean": 8667.845928361658,
    "spectral_bandwidth_mean": 5756.690565836429,
    "mfcc_0_mean": -1033.5679931640625,
    "mfcc_0_std": 0.0,
    "mfcc_1_mean": 19.382963180541992,
    "mfcc_1_std": 0.0,
    "mfcc_2_mean": -14.542179107666016,
    "mfcc_2_std": 0.0,
    "mfcc_3_mean": 10.23703384399414,
    "mfcc_3_std": 0.0,
    "mfcc_4_mean": -7.334988117218018,
    "mfcc_4_std": 0.0,
    "mfcc_5_mean": 5.278059959411621,
    "mfcc_5_std": 0.0,
    "mfcc_6_mean": -3.932213306427002,
    "mfcc_6_std": 0.0,
    "mfcc_7_mean": 2.892744302749634,
    "mfcc_7_std": 0.0,
    "mfcc_8_mean": -2.234200954437256,
    "mfcc_8_std": 0.0,
    "mfcc_9_mean": 1.6311900615692139,
    "mfcc_9_std": 0.0,
    "mfcc_10_mean": -1.2961642742156982,
    "mfcc_10_std": 0.0,
    "mfcc_11_mean": 0.9129663705825806,
    "mfcc_11_std": 0.0,
    "mfcc_12_mean": -0.7396003007888794,
    "mfcc_12_std": 0.0,
    "vocal_dominance_score_hpss": 0.5
  },
  "lyrics_features": {
    "cleaned_text": "And for love's sake each mistake you forgave. And soon both of us learn to trust. Not run away - it was no time to play We build it up and build it up and build it up. And now it's solid - solid as a rock That's what this love is That's what we've got Solid - solid as a rock and nothing's changed it The thrill is still hot hot hot hot hot... You didn't turn away when the sky went gray Somehow we managed we had to stick together You didn't bat an eye when I made you cry We knew down the line we would make it better And for love's sake each mistake you forgave. And soon both of us learn to trust. Not run away - it was no time to play We build it up and build it up and build it up. And now it's solid - solid as a rock. That's what this love is That's what we've got (Yes, it is) Solid - solid as a rock And nothing's changed it The thrill is still hot hot hot hot hot... Gone with the wind Another friend got in between and tried to seperate us. Knock knock on wood - you understood Love was so new - we did what we had to. And with that feeling we were willing to take a chance. So against all odds we made a start. We got serious - this wouldn't turn to dust We build it up and build it up and build it up. And now it's solid - solid as a rock. That's what this love is that's what we've got Solid (Yes, it is) - solid as a rock and nothing changed it The thrill is still hot hot hot hot hot... Solid - Solid as a rock (You know it) (Well) (You know it, baby) Solid - Solid as a rock (Lovin' me, lovin' me, oh) Solid (Don't leave me, baby) - Solid as a rock (Well, well, why, why) Solid - Solid as a rock (Every day it gets sweeter, now) Solid (You know I like it) - Solid as a rock (Good, good, well, it's good, good, good) Solid (Solid, solid, solid, solid, solid) - As a rock !",
    "language_code": "en",
    "completeness_heuristic": 0.8,
    "word_count": 382,
    "char_count": 1789,
    "sentence_count": 18,
    "type_token_ratio": 0.3795811518324607
  },
  "is_high_quality": false,
  "normalized_audio_path": "processed_dataset/MOOD/audio_rejected/317.wav"
}