{
  "track_id": "328",
  "provenance": {
    "original_audio_path": "../../data/raw/MIREX-like_mood/dataset/Audio/328.mp3",
    "original_lyrics_path": "../../data/raw/MIREX-like_mood/dataset/Lyrics/328.txt",
    "processing_date": "2025-10-24T22:16:40.807121+00:00",
    "script_version": "1.0.0"
  },
  "audio_properties": {
    "original_sr": 44100,
    "target_sr": 44100,
    "channels": 2
  },
  "audio_features": {
    "duration_seconds": 4.5351473922902495e-05,
    "integrated_loudness_lufs": -Infinity,
    "snr_percentile_db": 8.00616455078125,
    "clipping_percentage": 0.0,
    "rms_energy_mean": 2.801258006002172e-06,
    "rms_energy_std": 0.0,
    "zcr_mean": 0.0,
    "zcr_std": 0.0,
    "spectral_centroid_mean": 9344.062673827704,
    "spectral_bandwidth_mean": 6071.068503617601,
    "mfcc_0_mean": -1018.8200073242188,
    "mfcc_0_std": 0.0,
    "mfcc_1_mean": 14.548175811767578,
    "mfcc_1_std": 0.0,
    "mfcc_2_mean": -10.539665222167969,
    "mfcc_2_std": 0.0,
    "mfcc_3_mean": 7.033709526062012,
    "mfcc_3_std": 0.0,
    "mfcc_4_mean": -4.789636611938477,
    "mfcc_4_std": 0.0,
    "mfcc_5_mean": 3.255674362182617,
    "mfcc_5_std": 0.0,
    "mfcc_6_mean": -2.3303277492523193,
    "mfcc_6_std": 0.0,
    "mfcc_7_mean": 1.6297974586486816,
    "mfcc_7_std": 0.0,
    "mfcc_8_mean": -1.246971607208252,
    "mfcc_8_std": 0.0,
    "mfcc_9_mean": 0.8692899942398071,
    "mfcc_9_std": 0.0,
    "mfcc_10_mean": -0.7188230156898499,
    "mfcc_10_std": 0.0,
    "mfcc_11_mean": 0.4873426556587219,
    "mfcc_11_std": 0.0,
    "mfcc_12_mean": -0.4386897683143616,
    "mfcc_12_std": 0.0,
    "vocal_dominance_score_hpss": 0.5000000596046448
  },
  "lyrics_features": {
    "cleaned_text": "I guess now it's time for me to give up, I feel it's time. Got a picture of you beside me, got your lipstick mark still on your coffee cup. Got fist of pure emotion, got a head of shattered dreams, gotta leave it, gotta leave it all behind me. Whatever I said, whatever I did, I didn't mean it, I just want you back for good (want you back, want you back, want you back for good) Whenever I'm wrong, just tell me the song and I'll sing it, you'll be right and understood, (want you back, want you back, want you back for good) I want you back for good. Unaware but underlined, I figured out this story, It wasn't good, yet in a corner of my mind I celebrated glory, but that was not to be. In the twist of separation, you excelled at being free, can't you find a little room inside for me. Whatever I said, whatever I did, I didn't mean it, I just want you back for good (want you back, want you back, want you back for good) Whenever I'm wrong, just tell me the song and I'll sing it, you'll be right and understood, (want you back, want you back, want you back for good) I want you back for good. And we'll be together, this time is forever, we'll be fighting, yes forever we will be, so complete in our love, we will never be uncovered again. Whatever I said, whatever I did, I didn't mean it, I just want you back for good (want you back, want you back, want you back for good) Whenever I'm wrong, just tell me the song and I'll sing it, you'll be right and understood, (want you back, want you back, want you back for good) I want you back for good. Whatever I said, whatever I did, I didn't mean it, I just want you back for good (want you back, want you back, want you back for good) Whenever I'm wrong, just tell me the song and I'll sing it, you'll be right and understood, (want you back, want you back, want you back for good) I want you back for good. I guess now it's time that you can back for good.",
    "language_code": "en",
    "completeness_heuristic": 1.0,
    "word_count": 382,
    "char_count": 1913,
    "sentence_count": 12,
    "type_token_ratio": 0.31151832460732987
  },
  "is_high_quality": false,
  "normalized_audio_path": "processed_dataset/MOOD/audio_rejected/328.wav"
}