{
  "track_id": "390",
  "provenance": {
    "original_audio_path": "../../data/raw/MIREX-like_mood/dataset/Audio/390.mp3",
    "original_lyrics_path": "../../data/raw/MIREX-like_mood/dataset/Lyrics/390.txt",
    "processing_date": "2025-10-24T22:16:41.843664+00:00",
    "script_version": "1.0.0"
  },
  "audio_properties": {
    "original_sr": 44100,
    "target_sr": 44100,
    "channels": 2
  },
  "audio_features": {
    "duration_seconds": 4.5351473922902495e-05,
    "integrated_loudness_lufs": -Infinity,
    "snr_percentile_db": 1.725893497467041,
    "clipping_percentage": 0.0,
    "rms_energy_mean": 4.27737859354238e-07,
    "rms_energy_std": 0.0,
    "zcr_mean": 0.0,
    "zcr_std": 0.0,
    "spectral_centroid_mean": 8172.548815243086,
    "spectral_bandwidth_mean": 5426.632234582608,
    "mfcc_0_mean": -1131.370849609375,
    "mfcc_0_std": 0.0,
    "mfcc_1_mean": 0.0,
    "mfcc_1_std": 0.0,
    "mfcc_2_mean": 0.0,
    "mfcc_2_std": 0.0,
    "mfcc_3_mean": 0.0,
    "mfcc_3_std": 0.0,
    "mfcc_4_mean": 0.0,
    "mfcc_4_std": 0.0,
    "mfcc_5_mean": 0.0,
    "mfcc_5_std": 0.0,
    "mfcc_6_mean": 0.0,
    "mfcc_6_std": 0.0,
    "mfcc_7_mean": 0.0,
    "mfcc_7_std": 0.0,
    "mfcc_8_mean": 0.0,
    "mfcc_8_std": 0.0,
    "mfcc_9_mean": 0.0,
    "mfcc_9_std": 0.0,
    "mfcc_10_mean": 0.0,
    "mfcc_10_std": 0.0,
    "mfcc_11_mean": 0.0,
    "mfcc_11_std": 0.0,
    "mfcc_12_mean": 0.0,
    "mfcc_12_std": 0.0,
    "vocal_dominance_score_hpss": 0.5000000596046448
  },
  "lyrics_features": {
    "cleaned_text": "You walked into my house last night I couldn't help but notice A light that was long gone Still burning strong You were sitting Your fingers like fuses Your eyes were cinnamon You said you'd stand for every known abuse That was ever Threatened To anyone but you And why should I know better by now When I'm old enough not to? While every line speaks the language of love It never held the meaning I was thinking of And I can't decide over right or wrong I guess sometimes you need the place where you belong Some may sing the wrong words to the wrong melody It's little things like this that matter to me Others feel that you should stand For every known abuse to hand And all the things that they could never see You said you stood for every known abuse That was ever Promised To anyone like you Don't you wish you knew better by now When you're old enough not to? When every line speaks the language of love It never held the meaning I was thinking of And I can't decide over right or wrong You left the feeling that I just do not belong (do not belong, do not belong, do not belong) One drink too many and a joke gone too far I see a face drive like a stolen car Gets harder to hide when you're hitching a ride Harder to hide what you really saw Oh yeah, you stand for every known abuse That I've ever seen my way through Don't I wish I knew better by now? Well I think I'm starting to When every line speaks the language of love It never held the meaning I was thinking of And I lost the line between right or wrong I just want to find the place where I belong (why should you know better by now When you're old enough not to? I wish I knew better by now When I'm old enough not to)",
    "language_code": "en",
    "completeness_heuristic": 1.0,
    "word_count": 337,
    "char_count": 1686,
    "sentence_count": 5,
    "type_token_ratio": 0.44510385756676557
  },
  "is_high_quality": false,
  "normalized_audio_path": "processed_dataset/MOOD/audio_rejected/390.wav"
}