{
  "track_id": "455",
  "provenance": {
    "original_audio_path": "../../data/raw/MIREX-like_mood/dataset/Audio/455.mp3",
    "original_lyrics_path": "../../data/raw/MIREX-like_mood/dataset/Lyrics/455.txt",
    "processing_date": "2025-10-24T22:16:44.532073+00:00",
    "script_version": "1.0.0"
  },
  "audio_properties": {
    "original_sr": 44100,
    "target_sr": 44100,
    "channels": 2
  },
  "audio_features": {
    "duration_seconds": 4.5351473922902495e-05,
    "integrated_loudness_lufs": -Infinity,
    "snr_percentile_db": 3.0630316734313965,
    "clipping_percentage": 0.0,
    "rms_energy_mean": 0.00024579052114859223,
    "rms_energy_std": 0.0,
    "zcr_mean": 0.0,
    "zcr_std": 0.0,
    "spectral_centroid_mean": 8403.680603335666,
    "spectral_bandwidth_mean": 5593.760191098173,
    "mfcc_0_mean": -577.9998168945312,
    "mfcc_0_std": 0.0,
    "mfcc_1_mean": 22.193950653076172,
    "mfcc_1_std": 0.0,
    "mfcc_2_mean": -17.116863250732422,
    "mfcc_2_std": 0.0,
    "mfcc_3_mean": 12.571945190429688,
    "mfcc_3_std": 0.0,
    "mfcc_4_mean": -9.458052635192871,
    "mfcc_4_std": 0.0,
    "mfcc_5_mean": 7.218715667724609,
    "mfcc_5_std": 0.0,
    "mfcc_6_mean": -5.713819980621338,
    "mfcc_6_std": 0.0,
    "mfcc_7_mean": 4.534909248352051,
    "mfcc_7_std": 0.0,
    "mfcc_8_mean": -3.752880811691284,
    "mfcc_8_std": 0.0,
    "mfcc_9_mean": 3.039825916290283,
    "mfcc_9_std": 0.0,
    "mfcc_10_mean": -2.6061954498291016,
    "mfcc_10_std": 0.0,
    "mfcc_11_mean": 2.1340694427490234,
    "mfcc_11_std": 0.0,
    "mfcc_12_mean": -1.8801685571670532,
    "mfcc_12_std": 0.0,
    "vocal_dominance_score_hpss": 0.5000001192092896
  },
  "lyrics_features": {
    "cleaned_text": "Eli's comin'. Eli's comin' (Eli's a-comin') Well, you better hide your heart, your loving heart. Eli's a-comin' and the cards say a broken heart, A broken heart. Eli's comin', hide your heart, girl, Eli's comin', hide your heart, girl Girl, Eli's a-comin', you better hide, girl, Eli's a-comin', you better hide Girl, Eli's a-comin', you better hide, girl, Eli's comin', hide your heart, girl. You better, better hide your heart, Eli's comin', better walk. Walk but you'll never get away, no, You'll never get away from the burning a-heartache. I walked to Apollo by the bay, everywhere I go though, Eli's a-comin' (she walked but she never got away) Eli's a-comin' (she walked but she never got away) Eli's a-comin' and he's comin' to get ya (she walked but, she walked but). Get down on your knees (she walked but she never got away), Eli's comin',(Hide it, hide it, hide it) Girl, Eli's a-comin', you better hide, girl, Eli's a-comin', you better hide. Girl, Eli's a-comin', you better hide, girl, Eli's comin', hide your heart, girl (hide it). You better, better hide your heart Eli's comin', Better walk. Walk but you'll never get away, no, You'll never get away from the burning a-heartache. I walked to Apollo by the bay, everywhere I go though, Eli's a-comin' (she walked but she'll never get away) Eli's a-comin' (she walked but she'll never get away) Eli's a-comin' and he's comin' to get ya (she walked but, she walked but). Get down on your knees (she walked but she'll never get away) Get down on your knees. No, no, no, no Lord, I said no, no, no, no, no, no (hide it) She can (hide it) hide it, (hide it) You better (hide it) Somebody (hide it), you got to (hide it). Eli's comin'. Eli's comin' (Eli's a-comin') Well, you better hide your heart, your loving heart Eli's comin', better hide your heart, girl [Repeat x 4]",
    "language_code": "en",
    "completeness_heuristic": 1.0,
    "word_count": 323,
    "char_count": 1834,
    "sentence_count": 16,
    "type_token_ratio": 0.26625386996904027
  },
  "is_high_quality": false,
  "normalized_audio_path": "processed_dataset/MOOD/audio_rejected/455.wav"
}