{
  "track_id": "460",
  "provenance": {
    "original_audio_path": "../../data/raw/MIREX-like_mood/dataset/Audio/460.mp3",
    "original_lyrics_path": "../../data/raw/MIREX-like_mood/dataset/Lyrics/460.txt",
    "processing_date": "2025-10-24T22:16:43.959530+00:00",
    "script_version": "1.0.0"
  },
  "audio_properties": {
    "original_sr": 44100,
    "target_sr": 44100,
    "channels": 2
  },
  "audio_features": {
    "duration_seconds": 4.5351473922902495e-05,
    "integrated_loudness_lufs": -Infinity,
    "snr_percentile_db": 0.09100490063428879,
    "clipping_percentage": 0.0,
    "rms_energy_mean": 0.0001349026133539155,
    "rms_energy_std": 0.0,
    "zcr_mean": 0.0,
    "zcr_std": 0.0,
    "spectral_centroid_mean": 8007.469625509983,
    "spectral_bandwidth_mean": 5285.855864499464,
    "mfcc_0_mean": -638.5322265625,
    "mfcc_0_std": 0.0,
    "mfcc_1_mean": 26.39629554748535,
    "mfcc_1_std": 0.0,
    "mfcc_2_mean": -21.077266693115234,
    "mfcc_2_std": 0.0,
    "mfcc_3_mean": 16.279342651367188,
    "mfcc_3_std": 0.0,
    "mfcc_4_mean": -12.933368682861328,
    "mfcc_4_std": 0.0,
    "mfcc_5_mean": 10.485882759094238,
    "mfcc_5_std": 0.0,
    "mfcc_6_mean": -8.792253494262695,
    "mfcc_6_std": 0.0,
    "mfcc_7_mean": 7.441394805908203,
    "mfcc_7_std": 0.0,
    "mfcc_8_mean": -6.501546859741211,
    "mfcc_8_std": 0.0,
    "mfcc_9_mean": 5.642971038818359,
    "mfcc_9_std": 0.0,
    "mfcc_10_mean": -5.074721336364746,
    "mfcc_10_std": 0.0,
    "mfcc_11_mean": 4.477602005004883,
    "mfcc_11_std": 0.0,
    "mfcc_12_mean": -4.107407569885254,
    "mfcc_12_std": 0.0,
    "vocal_dominance_score_hpss": 0.5000002980232239
  },
  "lyrics_features": {
    "cleaned_text": "Heard of a van that is loaded with weapons, packed up and ready to go Heard of some grave sites, out by the highway, a place where nobody knows The sound of gunfire, off in the distance, I'm getting used to it now Lived in a brownstone, lived in the ghetto, I've lived all over this town This ain't no party, this ain't no disco, this ain't no fooling around No time for dancing, or lovey dovey, I ain't got time for that now Transmit the message, to the receiver, hope for an answer some day I got three passports, a couple of visas, you don't even know my real name High on a hillside, the trucks are loading, everything's ready to roll I sleep in the daytime, I work in the nighttime, I might not ever get home This ain't no party, this ain't no disco, this ain't no fooling around This ain't no Mudd Club, or C. B. G. B., I ain't got time for that now Heard about Houston? Heard about Detroit? Heard about Pittsburgh, P. A.? You oughta know not to stand by the window somebody might see you up there I got some groceries, some peanut butter, to last a couple of days But I ain't got no speakers, ain't got no headphones, ain't got no records to play Why stay in college? Why go to night school? Gonna be different this time Can't write a letter, can't send a postcard, I can't write nothing at all This ain't no party, this ain't no disco, this ain't no fooling around I'd like to kiss you, I'd love you hold you I ain't got no time for that now Trouble in transit, got through the roadblock, we blended with the crowd We got computer, we're tapping phone lines, I know that ain't allowed We dress like students, we dress like housewives, or in a suit and a tie I changed my hairstyle, so many times now, I don't know what I look like! You make me shiver, I feel so tender, we make a pretty good team Don't get exhausted, I'll do some driving, you ought to get some sleep Get you instructions, follow directions, then you should change your address Maybe tomorrow, maybe the next day, whatever you think is best Burned all my notebooks, what good are notebooks? They won't help me survive My chest is aching, burns like a furnace, the burning keeps me alive Try to stay healthy, physical fitness, don't want to catch no disease Try to be careful, don't take no chances, you better watch what you say",
    "language_code": "en",
    "completeness_heuristic": 1.0,
    "word_count": 438,
    "char_count": 2303,
    "sentence_count": 13,
    "type_token_ratio": 0.5365296803652968
  },
  "is_high_quality": false,
  "normalized_audio_path": "processed_dataset/MOOD/audio_rejected/460.wav"
}