{
  "track_id": "590",
  "provenance": {
    "original_audio_path": "../../data/raw/MIREX-like_mood/dataset/Audio/590.mp3",
    "original_lyrics_path": "../../data/raw/MIREX-like_mood/dataset/Lyrics/590.txt",
    "processing_date": "2025-10-24T22:16:43.816250+00:00",
    "script_version": "1.0.0"
  },
  "audio_properties": {
    "original_sr": 44100,
    "target_sr": 44100,
    "channels": 2
  },
  "audio_features": {
    "duration_seconds": 4.5351473922902495e-05,
    "integrated_loudness_lufs": -Infinity,
    "snr_percentile_db": 3.6904802322387695,
    "clipping_percentage": 0.0,
    "rms_energy_mean": 4.6608164439021493e-07,
    "rms_energy_std": 0.0,
    "zcr_mean": 0.0,
    "zcr_std": 0.0,
    "spectral_centroid_mean": 8524.121101695688,
    "spectral_bandwidth_mean": 5671.3282731821,
    "mfcc_0_mean": -1131.370849609375,
    "mfcc_0_std": 0.0,
    "mfcc_1_mean": 0.0,
    "mfcc_1_std": 0.0,
    "mfcc_2_mean": 0.0,
    "mfcc_2_std": 0.0,
    "mfcc_3_mean": 0.0,
    "mfcc_3_std": 0.0,
    "mfcc_4_mean": 0.0,
    "mfcc_4_std": 0.0,
    "mfcc_5_mean": 0.0,
    "mfcc_5_std": 0.0,
    "mfcc_6_mean": 0.0,
    "mfcc_6_std": 0.0,
    "mfcc_7_mean": 0.0,
    "mfcc_7_std": 0.0,
    "mfcc_8_mean": 0.0,
    "mfcc_8_std": 0.0,
    "mfcc_9_mean": 0.0,
    "mfcc_9_std": 0.0,
    "mfcc_10_mean": 0.0,
    "mfcc_10_std": 0.0,
    "mfcc_11_mean": 0.0,
    "mfcc_11_std": 0.0,
    "mfcc_12_mean": 0.0,
    "mfcc_12_std": 0.0,
    "vocal_dominance_score_hpss": 0.5
  },
  "lyrics_features": {
    "cleaned_text": "I'm the one-man army Ason, I've never been tooken out, I keep M.C.'s lookin' out, I drop science like girls be droppin' babies, Enough to make a nigga go cra-a-azy, Energy building, Takin' all types of medicine, Your ass thought you were better than, Ason, I keep planets in orbit, While I be comin' with deeper and more shit, Enough to make and bake and shake your ass and clock and take, Rhymes good as a tasty cake, mix, this style, I'm masterin', Niggas catchin' headaches, what, what? You need Aspirin, This type of pain, you couldn't even kill with Midol, Fuck around get sprayed with Lysol, In your face like a can of mace, baby, Is it burnin? Well, fuck, now you're learnin', How, I don't even like your motherfuckin' profile, Give me my fuckin' shit, (Ch-ch...plow!) Not seen and heard, no one knows, you forget, Niggas be quiet as kept, Now you know nuthin', before you knew a whole fuckin' lot, Your ass don't want to get shot, a lot of M.C.'s came through my showdown, To watch me put your fuckin' ass lo-o-ow down, As you can go, below zero, without a doubt I've never been tooken out, By a nigga, who couldn't figure, yo by a nigga, who couldn't figure, Yo by a nigga, who couldn't figure, how to pull a fuckin' gun triger, Get the fuck outta here! Nigga want to get too close, to the upmost, But I got stacks that'll attack any wack host, \"Introducin', yo fuck that nigga's name,\" My hip-hop drops on your head like ra-a-ain, And when it rains it pours, cause my rhymes hardcore, That's why I give you more of the raw, Talent that I got will riz-ock the spot, M.C.'s I be bur-are-rnin', bur-are-rnin' hot, Woah ho ho! Hit me like slow-mo with the flow, If I move too quick, oh, you just won't know, I'm homicidal when you enter the target, Nigga get up, act like a pig tryin to hog shit, So I take yo ass out quick, the mics I had my nigga, You can suck my dick, If you want to step to my motherfuckin' wreck, (Ch-ch plow! plow! plow!) blown to death, You got shot cause you knock knock knock, \"Who's there?\" Another motherfuckin' hardrock, Slackin' on your back cause raw's what you lack, You want to react? Bring it on back... Shame on You, when you step through to, the Ol' Dirty Bastard, Brooklyn Zoo! (X5) What? My nigga... Shame on ya...",
    "language_code": "en",
    "completeness_heuristic": 0.8,
    "word_count": 421,
    "char_count": 2258,
    "sentence_count": 23,
    "type_token_ratio": 0.6128266033254157
  },
  "is_high_quality": false,
  "normalized_audio_path": "processed_dataset/MOOD/audio_rejected/590.wav"
}