{
  "track_id": "635",
  "provenance": {
    "original_audio_path": "../../data/raw/MIREX-like_mood/dataset/Audio/635.mp3",
    "original_lyrics_path": "../../data/raw/MIREX-like_mood/dataset/Lyrics/635.txt",
    "processing_date": "2025-10-24T22:16:41.570150+00:00",
    "script_version": "1.0.0"
  },
  "audio_properties": {
    "original_sr": 44100,
    "target_sr": 44100,
    "channels": 2
  },
  "audio_features": {
    "duration_seconds": 4.5351473922902495e-05,
    "integrated_loudness_lufs": -Infinity,
    "snr_percentile_db": 12.230957984924316,
    "clipping_percentage": 0.0,
    "rms_energy_mean": 1.3211996474638e-06,
    "rms_energy_std": 0.0,
    "zcr_mean": 0.00048828125,
    "zcr_std": 0.0,
    "spectral_centroid_mean": 12096.094933952896,
    "spectral_bandwidth_mean": 6252.101895952159,
    "mfcc_0_mean": -1122.7823486328125,
    "mfcc_0_std": 0.0,
    "mfcc_1_mean": -10.746166229248047,
    "mfcc_1_std": 0.0,
    "mfcc_2_mean": 7.361464500427246,
    "mfcc_2_std": 0.0,
    "mfcc_3_mean": -3.7538323402404785,
    "mfcc_3_std": 0.0,
    "mfcc_4_mean": 1.3494863510131836,
    "mfcc_4_std": 0.0,
    "mfcc_5_mean": -0.4182475209236145,
    "mfcc_5_std": 0.0,
    "mfcc_6_mean": 0.30195552110671997,
    "mfcc_6_std": 0.0,
    "mfcc_7_mean": -0.2970159649848938,
    "mfcc_7_std": 0.0,
    "mfcc_8_mean": 0.15615949034690857,
    "mfcc_8_std": 0.0,
    "mfcc_9_mean": -0.018505334854125977,
    "mfcc_9_std": 0.0,
    "mfcc_10_mean": 0.01111682690680027,
    "mfcc_10_std": 0.0,
    "mfcc_11_mean": -0.061369311064481735,
    "mfcc_11_std": 0.0,
    "mfcc_12_mean": 0.06956082582473755,
    "mfcc_12_std": 0.0,
    "vocal_dominance_score_hpss": 0.5
  },
  "lyrics_features": {
    "cleaned_text": "Yeah! In the place to be! Chipmunks on the M I C! Witch Doctor! Everybody can they do it? (Can they do it?) Come on people let's get to it! (Let's get to it!) Come on shake, come on roll! Everybody hit the floor! Come on shake, come on roll! With the Chipmunks here we go! I told the witch doctor I was in love with you I told the witch doctor you didn't love me too! And then the witch doctor he told me what to do He said that Ooh to the eeh the ooh the aah aah To the ting to the tang the wallawalla bingbang Ooh to the eeh the ooh the aah aah Ting tang wallawalla bingbang Ooh to the eeh the ooh the aah aah To the ting to the tang the wallawalla bingbang Ooh to the eeh the ooh the aah aah Ting tang wallawalla bingbang Yo DJ pump this party! Everybody can they do it? (Can they do it?) Come on people let's get to it! (Let's get to it!) Come on shake, come on roll! Everybody hit the floor! Come on shake, come on roll! With the Chipmunks here we go! Alvin, Simon, Theodore! I told the witch doctor you didn't love me too! I told the witch doctor you didn't love me nice! And then the witch doctor he gave me this advice He said to Ooh eeh, yeah, come on ooh aah Ooh to the eeh the ooh the aah aah To the ting to the tang the wallawalla bingbang Ooh to the eeh the ooh the aah aah Ting tang wallawalla bingbang Ooh to the eeh the ooh the aah aah To the ting to the tang the wallawalla bingbang Ooh to the eeh the ooh the aah aah Ting tang wallawalla bingbang Yeah you've been keeping love from me And that's not very smart! (Not very smart) So I went out and found myself Someone who'd tell me how to win your heart! (Whoa! Yeah!) My friend the witch doctor he told me what to say My friend the witch doctor he told me what to do I know that you'll be mine when I say this to you, whoa! Oh baby baby! Everybody can they do it? (Can they do it?) Come on people let's get to it! (Let's get to it!) Come on shake, come on roll! Everybody hit the floor! Come on shake, come on roll! With the Chipmunks here we go! Ooh to the eeh the ooh the aah aah To the ting to the tang the wallawalla bingbang Ooh to the eeh the ooh the aah aah Ting tang wallawalla bingbang Ooh to the eeh the ooh the aah aah To the ting to the tang the wallawalla bingbang Ooh to the eeh the ooh the aah aah Ting tang wallawalla bingbang Ooh to the eeh the ooh the aah aah To the ting to the tang the wallawalla bingbang Ooh to the eeh the ooh the aah aah Ting tang wallawalla bingbang Ooh to the eeh the ooh the aah aah To the ting to the tang the wallawalla bingbang Ooh to the eeh the ooh the aah aah Ting tang wallawalla bingbang",
    "language_code": "en",
    "completeness_heuristic": 1.0,
    "word_count": 542,
    "char_count": 2607,
    "sentence_count": 40,
    "type_token_ratio": 0.2140221402214022
  },
  "is_high_quality": true,
  "normalized_audio_path": "processed_dataset/MOOD/audio_normalized/635.wav"
}