{
  "track_id": "636",
  "provenance": {
    "original_audio_path": "../../data/raw/MIREX-like_mood/dataset/Audio/636.mp3",
    "original_lyrics_path": "../../data/raw/MIREX-like_mood/dataset/Lyrics/636.txt",
    "processing_date": "2025-10-24T22:16:43.429562+00:00",
    "script_version": "1.0.0"
  },
  "audio_properties": {
    "original_sr": 44100,
    "target_sr": 44100,
    "channels": 2
  },
  "audio_features": {
    "duration_seconds": 4.5351473922902495e-05,
    "integrated_loudness_lufs": -Infinity,
    "snr_percentile_db": 9.4463529586792,
    "clipping_percentage": 0.0,
    "rms_energy_mean": 4.587102921504993e-06,
    "rms_energy_std": 0.0,
    "zcr_mean": 0.0,
    "zcr_std": 0.0,
    "spectral_centroid_mean": 9577.573154719747,
    "spectral_bandwidth_mean": 6150.859211204079,
    "mfcc_0_mean": -971.3556518554688,
    "mfcc_0_std": 0.0,
    "mfcc_1_mean": 12.700811386108398,
    "mfcc_1_std": 0.0,
    "mfcc_2_mean": -9.065237045288086,
    "mfcc_2_std": 0.0,
    "mfcc_3_mean": 5.901537895202637,
    "mfcc_3_std": 0.0,
    "mfcc_4_mean": -3.9233269691467285,
    "mfcc_4_std": 0.0,
    "mfcc_5_mean": 2.587172746658325,
    "mfcc_5_std": 0.0,
    "mfcc_6_mean": -1.8109476566314697,
    "mfcc_6_std": 0.0,
    "mfcc_7_mean": 1.2230851650238037,
    "mfcc_7_std": 0.0,
    "mfcc_8_mean": -0.9264710545539856,
    "mfcc_8_std": 0.0,
    "mfcc_9_mean": 0.6152274012565613,
    "mfcc_9_std": 0.0,
    "mfcc_10_mean": -0.5162185430526733,
    "mfcc_10_std": 0.0,
    "mfcc_11_mean": 0.32495903968811035,
    "mfcc_11_std": 0.0,
    "mfcc_12_mean": -0.3078373074531555,
    "mfcc_12_std": 0.0,
    "vocal_dominance_score_hpss": 0.5
  },
  "lyrics_features": {
    "cleaned_text": "Hi Barbie Hi Ken! Do you wanna go for a ride? Sure Ken! Jump In... I'm a barbie girl, in the barbie world Life in plastic, it's fantastic! you can brush my hair, undress me everywhere Imagination, life is your creation Come on Barbie, let's go party! I'm a barbie girl, in the barbie world Life in plastic, it's fantastic! you can brush my hair, undress me everywhere Imagination, life is your creation I'm a blond bimbo girl, in the fantasy world Dress me up, make it tight, I'm your dolly You're my doll, rock'n'roll, feel the glamour in pink, kiss me here, touch me there, hanky panky... You can touch, you can play, if you say: \"I'm always yours\" (uu-oooh-u) I'm a barbie girl, in the barbie world Life in plastic, it's fantastic! you can brush my hair, undress me everywhere Imagination, life is your creation Come on Barbie, let's go party! (Ah-ah-ah-yeah) Come on Barbie, let's go party! (uu-oooh-u) Come on Barbie, let's go party! (Ah-ah-ah-yeah) Come on Barbie, let's go party! (uu-oooh-u) Make me walk, make me talk, do whatever you please I can act like a star, I can beg on my knees Come jump in, bimbo friend, let us do it again, hit the town, fool around, let's go party You can touch, you can play, if you say: \"I'm always yours\" You can touch, you can play, if you say: \"I'm always yours\" Come on Barbie, let's go party! (Ah-ah-ah-yeah) Come on Barbie, let's go party! (uu-oooh-u) Come on Barbie, let's go party! (Ah-ah-ah-yeah) Come on Barbie, let's go party! (uu-oooh-u) I'm a barbie girl, in the barbie world Life in plastic, it's fantastic! you can brush my hair, undress me everywhere Imagination, life is your creation I'm a barbie girl, in the barbie world Life in plastic, it's fantastic! you can brush my hair, undress me everywhere Imagination, life is your creation Come on Barbie, let's go party! (Ah-ah-ah-yeah) Come on Barbie, let's go party! (uu-oooh-u) Come on Barbie, let's go party! (Ah-ah-ah-yeah) Come on Barbie, let's go party! (uu-oooh-u) Oh, I'm having so much fun! Well Barbie, we're just getting started Oh, I love you Ken!",
    "language_code": "en",
    "completeness_heuristic": 0.8,
    "word_count": 364,
    "char_count": 2064,
    "sentence_count": 26,
    "type_token_ratio": 0.28846153846153844
  },
  "is_high_quality": false,
  "normalized_audio_path": "processed_dataset/MOOD/audio_rejected/636.wav"
}