{
  "track_id": "728",
  "provenance": {
    "original_audio_path": "../../data/raw/MIREX-like_mood/dataset/Audio/728.mp3",
    "original_lyrics_path": "../../data/raw/MIREX-like_mood/dataset/Lyrics/728.txt",
    "processing_date": "2025-10-24T22:16:43.580631+00:00",
    "script_version": "1.0.0"
  },
  "audio_properties": {
    "original_sr": 44100,
    "target_sr": 44100,
    "channels": 2
  },
  "audio_features": {
    "duration_seconds": 4.5351473922902495e-05,
    "integrated_loudness_lufs": -Infinity,
    "snr_percentile_db": 9.923271179199219,
    "clipping_percentage": 0.0,
    "rms_energy_mean": 5.34480193437048e-07,
    "rms_energy_std": 0.0,
    "zcr_mean": 0.00048828125,
    "zcr_std": 0.0,
    "spectral_centroid_mean": 12400.981201195194,
    "spectral_bandwidth_mean": 6172.615815926665,
    "mfcc_0_mean": -1131.370849609375,
    "mfcc_0_std": 0.0,
    "mfcc_1_mean": 0.0,
    "mfcc_1_std": 0.0,
    "mfcc_2_mean": 0.0,
    "mfcc_2_std": 0.0,
    "mfcc_3_mean": 0.0,
    "mfcc_3_std": 0.0,
    "mfcc_4_mean": 0.0,
    "mfcc_4_std": 0.0,
    "mfcc_5_mean": 0.0,
    "mfcc_5_std": 0.0,
    "mfcc_6_mean": 0.0,
    "mfcc_6_std": 0.0,
    "mfcc_7_mean": 0.0,
    "mfcc_7_std": 0.0,
    "mfcc_8_mean": 0.0,
    "mfcc_8_std": 0.0,
    "mfcc_9_mean": 0.0,
    "mfcc_9_std": 0.0,
    "mfcc_10_mean": 0.0,
    "mfcc_10_std": 0.0,
    "mfcc_11_mean": 0.0,
    "mfcc_11_std": 0.0,
    "mfcc_12_mean": 0.0,
    "mfcc_12_std": 0.0,
    "vocal_dominance_score_hpss": 0.5
  },
  "lyrics_features": {
    "cleaned_text": "I woke up alarmed I didn't know where I was at first Just that I woke up in your arms And almost immediately I felt sorry 'Cause I didn't think this would happen again No matter what I could do or say Just that I didn't think this would happen again With or without my best intentions And whatever happened to a boyfriend The kind of guy who tries to win you over? And whatever happened to a boyfriend The kind of guy who makes love 'cause he's in it? And I want a boyfriend I want a boyfriend I want all that boring old shit like letters and sodas Letters and sodas You got up out of bed You said you had a lot of work to do But I heard the rest in your head And almost immediately I felt sorry 'Cause I didn't think this would happen again No matter what I could do or say Just that I didn't think this would happen again With or without my best intentions And I want a boyfriend I want a boyfriend I want all that stupid old shit like letters and sodas And I can feel it in my bones I'm gonna spend another year alone It's fuck and run, fuck and run Even when I was seventeen Fuck and run, fuck and run Even when I was twelve And I can feel it in my bones I'm gonna spend my whole life alone It's fuck and run, fuck and run Even when I was seventeen Fuck and run, fuck and run Even when I was twelve You almost felt bad You said that I should call you up But I knew much better than that And almost immediately you felt sorry 'Cause you didn't think this would happen again No matter what you could do or say Just that you didn't think this would happen again Without or without your best intentions And whatever happened to a girlfriend The kind of chick who tries to win you over? And whatever happened to a girlfriend The kind of chick who makes love 'cause she's in it? And you want a girlfriend You want a girlfriend You want all that boring old shit like letters and sodas Letters and sodas Letters and sodas Letters and sodas",
    "language_code": "en",
    "completeness_heuristic": 1.0,
    "word_count": 387,
    "char_count": 1935,
    "sentence_count": 5,
    "type_token_ratio": 0.29198966408268734
  },
  "is_high_quality": false,
  "normalized_audio_path": "processed_dataset/MOOD/audio_rejected/728.wav"
}