{
  "track_id": "764",
  "provenance": {
    "original_audio_path": "../../data/raw/MIREX-like_mood/dataset/Audio/764.mp3",
    "original_lyrics_path": "../../data/raw/MIREX-like_mood/dataset/Lyrics/764.txt",
    "processing_date": "2025-10-24T22:16:37.016342+00:00",
    "script_version": "1.0.0"
  },
  "audio_properties": {
    "original_sr": 44100,
    "target_sr": 44100,
    "channels": 2
  },
  "audio_features": {
    "duration_seconds": 4.5351473922902495e-05,
    "integrated_loudness_lufs": -Infinity,
    "snr_percentile_db": 26.609283447265625,
    "clipping_percentage": 0.0,
    "rms_energy_mean": 1.3618532648251858e-06,
    "rms_energy_std": 0.0,
    "zcr_mean": 0.0,
    "zcr_std": 0.0,
    "spectral_centroid_mean": 10816.091785803997,
    "spectral_bandwidth_mean": 6367.0170303967625,
    "mfcc_0_mean": -1100.9068603515625,
    "mfcc_0_std": 0.0,
    "mfcc_1_mean": 2.0035500526428223,
    "mfcc_1_std": 0.0,
    "mfcc_2_mean": -1.378133773803711,
    "mfcc_2_std": 0.0,
    "mfcc_3_mean": 0.7179648876190186,
    "mfcc_3_std": 0.0,
    "mfcc_4_mean": -0.4513481855392456,
    "mfcc_4_std": 0.0,
    "mfcc_5_mean": 0.21673592925071716,
    "mfcc_5_std": 0.0,
    "mfcc_6_mean": -0.1656647026538849,
    "mfcc_6_std": 0.0,
    "mfcc_7_mean": 0.0573410764336586,
    "mfcc_7_std": 0.0,
    "mfcc_8_mean": -0.08685918152332306,
    "mfcc_8_std": 0.0,
    "mfcc_9_mean": 0.0012046359479427338,
    "mfcc_9_std": 0.0,
    "mfcc_10_mean": -0.06004306674003601,
    "mfcc_10_std": 0.0,
    "mfcc_11_mean": -0.018124595284461975,
    "mfcc_11_std": 0.0,
    "mfcc_12_mean": -0.046272337436676025,
    "mfcc_12_std": 0.0,
    "vocal_dominance_score_hpss": 0.5
  },
  "lyrics_features": {
    "cleaned_text": "Once upon a time you dressed so fine You threw the bums a dime in your prime, didn't you ? People'd call, say, \"Beware doll, you're bound to fall\" You thought they were all kiddin' you You used to laugh about Everybody that was hangin' out Now you don't talk so loud Now you don't seem so proud About having to be scrounging for your next meal. How does it feel How does it feel To be without a home Like a complete unknown Like a rolling stone ? You've gone to the finest school all right, Miss Lonely But you know you only used to get juiced in it And nobody has ever taught you how to live on the street And now you find out you're gonna have to get used to it You said you'd never compromise With the mystery tramp, but know you realize He's not selling any alibis As you stare into the vacuum of his eyes And say do you want to make a deal? How does it feel How does it feel To be on your own With no direction home Like a complete unknown Like a rolling stone ? You never turned around to see the frowns on the jugglers and the clowns When they all come down and did tricks for you You never understood that it ain't no good You shouldn't let other people get your kicks for you You used to ride on the chrome horse with your diplomat Who carried on his shoulder a Siamese cat Ain't it hard when you discover that He really wasn't where it's at After he took from you everything he could steal. How does it feel How does it feel To be on your own With no direction home Like a complete unknown Like a rolling stone ? Princess on the steeple and all the pretty people They're drinkin', thinkin' that they got it made Exchanging all precious gifts But you'd better take your diamond ring, you'd better pawn it babe You used to be so amused At Napoleon in rags and the language that he used Go to him now, he calls you, you can't refuse When you got nothing, you got nothing to lose You're invisible now, you got no secrets to conceal. How does it feel How does it feel To be on your own With no direction home Like a complete unknown Like a rolling stone ?",
    "language_code": "en",
    "completeness_heuristic": 1.0,
    "word_count": 409,
    "char_count": 2060,
    "sentence_count": 10,
    "type_token_ratio": 0.4938875305623472
  },
  "is_high_quality": true,
  "normalized_audio_path": "processed_dataset/MOOD/audio_normalized/764.wav"
}