{
  "track_id": "776",
  "provenance": {
    "original_audio_path": "../../data/raw/MIREX-like_mood/dataset/Audio/776.mp3",
    "original_lyrics_path": "../../data/raw/MIREX-like_mood/dataset/Lyrics/776.txt",
    "processing_date": "2025-10-24T22:16:43.451966+00:00",
    "script_version": "1.0.0"
  },
  "audio_properties": {
    "original_sr": 44100,
    "target_sr": 44100,
    "channels": 2
  },
  "audio_features": {
    "duration_seconds": 4.5351473922902495e-05,
    "integrated_loudness_lufs": -Infinity,
    "snr_percentile_db": 0.02133295312523842,
    "clipping_percentage": 0.0,
    "rms_energy_mean": 2.6276507014699746e-07,
    "rms_energy_std": 0.0,
    "zcr_mean": 0.0,
    "zcr_std": 0.0,
    "spectral_centroid_mean": 8006.475287321647,
    "spectral_bandwidth_mean": 5284.852392771569,
    "mfcc_0_mean": -1131.370849609375,
    "mfcc_0_std": 0.0,
    "mfcc_1_mean": 0.0,
    "mfcc_1_std": 0.0,
    "mfcc_2_mean": 0.0,
    "mfcc_2_std": 0.0,
    "mfcc_3_mean": 0.0,
    "mfcc_3_std": 0.0,
    "mfcc_4_mean": 0.0,
    "mfcc_4_std": 0.0,
    "mfcc_5_mean": 0.0,
    "mfcc_5_std": 0.0,
    "mfcc_6_mean": 0.0,
    "mfcc_6_std": 0.0,
    "mfcc_7_mean": 0.0,
    "mfcc_7_std": 0.0,
    "mfcc_8_mean": 0.0,
    "mfcc_8_std": 0.0,
    "mfcc_9_mean": 0.0,
    "mfcc_9_std": 0.0,
    "mfcc_10_mean": 0.0,
    "mfcc_10_std": 0.0,
    "mfcc_11_mean": 0.0,
    "mfcc_11_std": 0.0,
    "mfcc_12_mean": 0.0,
    "mfcc_12_std": 0.0,
    "vocal_dominance_score_hpss": 0.5000003576278687
  },
  "lyrics_features": {
    "cleaned_text": "The devil went down to Georgia, he was looking for a soul to steal. He was in a bind cause he was way behind, and he was willin' to make a deal. When he came across this young man sawin' on a fiddle and playin' it hot. And the devil jumped up on a hickory stump and said: \"Boy let me tell you what...I guess you didn't know it, but I'm a fiddle player too. And if you'd care to take a dare, I'll make a bet with you. Now you play a pretty good fiddle, boy, but give the devil his due. I'll bet a fiddle of gold against your soul, cause I think I'm better than you.\" The boy said \"My name's Johnny and it might be a sin, But I'll take your bet, 'n' your gonna regret, cause I'm the best there's ever been.\" Johnny rosin up your bow and play your fiddle hard. Cause hell's broke loose in Georgia and the devil deals the cards. And if you win you'll get this shiny fiddle made of gold. But if you lose, the devil gets your soul. The devil opened up his case and he said \"I'll start this show.\" And fire flew from his fingertips as he rosined up his bow. And he pulled the bow across the strings and it made an evil hiss. Then a band of demons joined in and it sounded something like this. When the devil finished, Johnny said: \"Well you're pretty good ol' son, but sit down in that chair right there and let me show you how its done.\" Fire on the mountain, run boys, run. The devil's in the house of the risin' sun. Chicken in the bread pan, pickin' out dough. Granny, does your dog bite? No, child, no. The devil bowed his head because he knew that he'd been beat, and he laid that golden fiddle down on the ground at Johnny's feet. Johnny said \"Devil just come on back if you ever want to try again, I done told you once, you son of a bitch (gun), I'm the best there's ever been.\" And he played fire on the mountain, run boys, run. The devil's in the house of the risin' sun. Chicken in the bread pan pickin' out dough. Granny, will your dog bite? No, child, no.",
    "language_code": "en",
    "completeness_heuristic": 0.8,
    "word_count": 393,
    "char_count": 1961,
    "sentence_count": 31,
    "type_token_ratio": 0.5343511450381679
  },
  "is_high_quality": false,
  "normalized_audio_path": "processed_dataset/MOOD/audio_rejected/776.wav"
}