{
  "track_id": "835",
  "provenance": {
    "original_audio_path": "../../data/raw/MIREX-like_mood/dataset/Audio/835.mp3",
    "original_lyrics_path": "../../data/raw/MIREX-like_mood/dataset/Lyrics/835.txt",
    "processing_date": "2025-10-24T22:16:37.018699+00:00",
    "script_version": "1.0.0"
  },
  "audio_properties": {
    "original_sr": 44100,
    "target_sr": 44100,
    "channels": 2
  },
  "audio_features": {
    "duration_seconds": 4.5351473922902495e-05,
    "integrated_loudness_lufs": -Infinity,
    "snr_percentile_db": 6.4737396240234375,
    "clipping_percentage": 0.0,
    "rms_energy_mean": 5.9995138144586235e-05,
    "rms_energy_std": 0.0,
    "zcr_mean": 0.0,
    "zcr_std": 0.0,
    "spectral_centroid_mean": 9068.204033625192,
    "spectral_bandwidth_mean": 5958.709868028585,
    "mfcc_0_mean": -716.8771362304688,
    "mfcc_0_std": 0.0,
    "mfcc_1_mean": 16.718460083007812,
    "mfcc_1_std": 0.0,
    "mfcc_2_mean": -12.328141212463379,
    "mfcc_2_std": 0.0,
    "mfcc_3_mean": 8.462020874023438,
    "mfcc_3_std": 0.0,
    "mfcc_4_mean": -5.9281463623046875,
    "mfcc_4_std": 0.0,
    "mfcc_5_mean": 4.169686317443848,
    "mfcc_5_std": 0.0,
    "mfcc_6_mean": -3.06827974319458,
    "mfcc_6_std": 0.0,
    "mfcc_7_mean": 2.2293076515197754,
    "mfcc_7_std": 0.0,
    "mfcc_8_mean": -1.7364287376403809,
    "mfcc_8_std": 0.0,
    "mfcc_9_mean": 1.2706671953201294,
    "mfcc_9_std": 0.0,
    "mfcc_10_mean": -1.0494364500045776,
    "mfcc_10_std": 0.0,
    "mfcc_11_mean": 0.7607089281082153,
    "mfcc_11_std": 0.0,
    "mfcc_12_mean": -0.6655977368354797,
    "mfcc_12_std": 0.0,
    "vocal_dominance_score_hpss": 0.4999999701976776
  },
  "lyrics_features": {
    "cleaned_text": "Bass! Ooh White, White Ooh White, White Ooh White, White (Ooh White Lines) Vision dreams of passion (Blowin' through my mind) and all the while I think of you (High price) a very strange reaction (For us to unwind) the more I see, the more I do (Something like a phenomenon) Baby! (Tellin your body to come along, but white lines blow away) (Blow! Rock it! Blow!) Ticket to ride, white line highway Tell all your friends, they can go my way Pay your toll, sell your soul Pound for pound costs more than gold The longer you stay, the more you pay My white lines go a long way Either up your nose or through your vein With nothin to gain except killin' your brain (Freeze! Rock! Freeze! Rock! Freeze! Rock! Freeze! Rock!) (Blow!) (Ahhh) Higher, baby (Ahhh) Get higher, baby! (Ahhh) Get higher, baby! And don't ever come down! (Freebase!) Rang dang diggedy dang di-dang Rang dang diggedy dang di-dang Rang dang diggedy dang di-dang Diggedy dang di-dang diggedy dang di-dang (Pipeline) pure as the driven snow (Connected to my mind) and now I'm havin' fun, baby! (High price) it's getting kinda low (Cause it makes you feel so nice) I need some one-on-one, baby! (Don't let it blow your mind away) Baby! (And go into your little hideaway 'cause white lines blow away) (Blow! Rock it! Blow!) A million magic crystals, painted pure and white A multi-million dollars almost overnight Twice as sweet as sugar, twice as bitter as salt And if you get hooked, baby, it's nobody else's fault, so don't do it! (Freeze! Rock! Freeze! Rock! Freeze! Rock! Freeze! Rock!) Raah! (Blow!) (Ahhh) Higher, baby (Ahhh) Get higher, baby! (Ahhh) Get higher, baby! And don't ever come down! (Freebase!) (Don't you get too high) don't you get too high baby! (Turns you on) you really turn me on and on ('Cause you gotta come down) my temperature is risin' (When the thrill is gone) no, I don't want you to go A street kid gets arrested, gonna do some time He got out three years from now just to commit more crime A businessman is caught with 24 kilos He's out on bail and out of jail And that's the way it goes Raah! (Kane! Sugar! Kane! Sugar! Kane!) Athletes rejected, governerds corrected Gangsters, thugs and smugglers are thoroughly respected The money gets divided The women get excited Now I'm broke and it's no joke It's hard as hell to fight it, don't buy it! (Freeze! Haha ha ha! Rock! Freeze! Rock! Freeze! Rock! Freeze! Rock!) Raah! (Blow!) (Ahhh) Get higher, baby (Ahhh) Get higher, girl! (Ahhh) Get higher, baby! C'mon! Raah! (White Lines) Vision dreams of passion (Blowin' through my mind) and all the while I think of you (High price) a very strange reaction (For us to unwind) the more I see, the more I do (Something like a phenomenon) Baby! (Tellin your body to come along, but white lines blow away) Little Jack Horner sitting on the corner With no shoes and clothes This aint funny, but he took his money And sniffed it up his nose (Hey man, you wanna cop some blow?) (Sure, what you got, dust, flakes or rocks?) (I got China White, Mother of Pearl, Ivory Flake, What you need?) (Well yeah, well let me check it out man, just let me get a freeze) (Go ahead man, stuff I got should kill ya!) (Yeah man th-that's that's raw, wuh) (Freeze! Haha ha ha! Rock! Freeze! Rock! Freeze! Rock! Freeze! Rock! Freeze! Rock! Freeze! Rock!)",
    "language_code": "en",
    "completeness_heuristic": 1.0,
    "word_count": 597,
    "char_count": 3319,
    "sentence_count": 81,
    "type_token_ratio": 0.48911222780569513
  },
  "is_high_quality": false,
  "normalized_audio_path": "processed_dataset/MOOD/audio_rejected/835.wav"
}