{
  "track_id": "007",
  "provenance": {
    "original_audio_path": "../../data/raw/MIREX-like_mood/dataset/Audio/007.mp3",
    "original_lyrics_path": "../../data/raw/MIREX-like_mood/dataset/Lyrics/007.txt",
    "processing_date": "2025-10-24T22:16:39.012914+00:00",
    "script_version": "1.0.0"
  },
  "audio_properties": {
    "original_sr": 44100,
    "target_sr": 44100,
    "channels": 2
  },
  "audio_features": {
    "duration_seconds": 4.5351473922902495e-05,
    "integrated_loudness_lufs": -Infinity,
    "snr_percentile_db": 3.0627644062042236,
    "clipping_percentage": 0.0,
    "rms_energy_mean": 1.4116394595475867e-06,
    "rms_energy_std": 0.0,
    "zcr_mean": 0.0,
    "zcr_std": 0.0,
    "spectral_centroid_mean": 8403.622644703879,
    "spectral_bandwidth_mean": 5593.721438578278,
    "mfcc_0_mean": -1080.5318603515625,
    "mfcc_0_std": 0.0,
    "mfcc_1_mean": 15.85274600982666,
    "mfcc_1_std": 0.0,
    "mfcc_2_mean": -10.894515991210938,
    "mfcc_2_std": 0.0,
    "mfcc_3_mean": 6.543437480926514,
    "mfcc_3_std": 0.0,
    "mfcc_4_mean": -3.6920785903930664,
    "mfcc_4_std": 0.0,
    "mfcc_5_mean": 1.775547742843628,
    "mfcc_5_std": 0.0,
    "mfcc_6_mean": -0.6436924934387207,
    "mfcc_6_std": 0.0,
    "mfcc_7_mean": -0.12340783327817917,
    "mfcc_7_std": 0.0,
    "mfcc_8_mean": 0.46701663732528687,
    "mfcc_8_std": 0.0,
    "mfcc_9_mean": -0.7275245189666748,
    "mfcc_9_std": 0.0,
    "mfcc_10_mean": 0.706719160079956,
    "mfcc_10_std": 0.0,
    "mfcc_11_mean": -0.7339954376220703,
    "mfcc_11_std": 0.0,
    "mfcc_12_mean": 0.5630266666412354,
    "mfcc_12_std": 0.0,
    "vocal_dominance_score_hpss": 0.5
  },
  "lyrics_features": {
    "cleaned_text": "Woo, I gave you my money, I gave you my time. Why you wanna hurt me, girl? Are you serious? I'm just curious. Why you wanna hurt me, girl? Just because you're not for real Why you wanna hurt me, girl? Just because you're not for real, Why you wanna hurt me, girl? Never, ever had a lover who put the pedal to the mettle And burn rubber on me, Charlie Oh, no You took my money, you took my time Made me think everything was fine Then you upped and ran away And made me just go crazy I never, ever had a lover Who put the pedal to the metal And burn rubber on me, Charlie Oh, no, no, no Just because you're not for real Why you wanna hurt me, girl Just because you're not for real Why you wanna hurt me, girl I never, ever had a lover Who put the pedal to the metal And burn rubber on me, Charlie Oh, no, no, no Just because you're not for real Why you wanna hurt me, girl Just because you're not for real Why you wanna hurt me, girl You told me to go up the block And get you a strawberry pop When I got back to the flat You had burned rubber out the back I went to the closet and saw no clothes All I saw was hangers and poles I went to the phone and called your mother And told me you had burned rubber on me, Charlie OH, no, no (x13) Just because you're not for real Why you wanna hurt me, girl Just because you're not for real Why you wanna hurt me, girl I never, ever had a lover Who put the pedal to the metal And burned rubber on me, Charlie OH, no, no, no, no, oh, no, yeah, yeah Just because you're not for real Why you wanna hurt, me girl Just because you're not for real Why you wanna hurt me , girl Just because your not for real Why you wanna hurt me, girl You took my money, you took my time Made me think everything was fine Like the clock on the wall, said ding-ding-dong Got to find another lover that won't be gone She won't put the pedal to the metal And burn rubber, burn rubber, on me, Charlie NO, no, no, no I never, ever had a lover Who put the pedal to the metal And burned rubber on me, Charlie NO, no, no, no, no, no(repeat 8x)",
    "language_code": "en",
    "completeness_heuristic": 1.0,
    "word_count": 426,
    "char_count": 2052,
    "sentence_count": 8,
    "type_token_ratio": 0.2605633802816901
  },
  "is_high_quality": false,
  "normalized_audio_path": "processed_dataset/MOOD/audio_rejected/007.wav"
}