{
  "track_id": "009",
  "provenance": {
    "original_audio_path": "../../data/raw/MIREX-like_mood/dataset/Audio/009.mp3",
    "original_lyrics_path": "../../data/raw/MIREX-like_mood/dataset/Lyrics/009.txt",
    "processing_date": "2025-10-24T22:16:38.550326+00:00",
    "script_version": "1.0.0"
  },
  "audio_properties": {
    "original_sr": 44100,
    "target_sr": 44100,
    "channels": 2
  },
  "audio_features": {
    "duration_seconds": 4.5351473922902495e-05,
    "integrated_loudness_lufs": -Infinity,
    "snr_percentile_db": 1.0013302564620972,
    "clipping_percentage": 0.0,
    "rms_energy_mean": 3.2348134482163005e-06,
    "rms_energy_std": 0.0,
    "zcr_mean": 0.0,
    "zcr_std": 0.0,
    "spectral_centroid_mean": 8075.198741097483,
    "spectral_bandwidth_mean": 5346.953630621817,
    "mfcc_0_mean": -1002.9622192382812,
    "mfcc_0_std": 0.0,
    "mfcc_1_mean": 23.10968017578125,
    "mfcc_1_std": 0.0,
    "mfcc_2_mean": -17.8236083984375,
    "mfcc_2_std": 0.0,
    "mfcc_3_mean": 13.06425666809082,
    "mfcc_3_std": 0.0,
    "mfcc_4_mean": -9.758890151977539,
    "mfcc_4_std": 0.0,
    "mfcc_5_mean": 7.35357141494751,
    "mfcc_5_std": 0.0,
    "mfcc_6_mean": -5.704044818878174,
    "mfcc_6_std": 0.0,
    "mfcc_7_mean": 4.399338722229004,
    "mfcc_7_std": 0.0,
    "mfcc_8_mean": -3.5078389644622803,
    "mfcc_8_std": 0.0,
    "mfcc_9_mean": 2.6998369693756104,
    "mfcc_9_std": 0.0,
    "mfcc_10_mean": -2.184410810470581,
    "mfcc_10_std": 0.0,
    "mfcc_11_mean": 1.6423065662384033,
    "mfcc_11_std": 0.0,
    "mfcc_12_mean": -1.3292323350906372,
    "mfcc_12_std": 0.0,
    "vocal_dominance_score_hpss": 0.5
  },
  "lyrics_features": {
    "cleaned_text": "[Chorus: x2] I'm goin down down baby, yo' street in a range rover (c'mon) Street sweeper baby, cocked ready to let it go (hot shit!) Shimmy shimmy cocoa what? Listen to it pound Light it up and take a puff, pass it to me now You can find me, in St. Louis rolling on dubs Smoking on dubs in clubs, blowing up like cocoa puffs Sipping bud, getting perved and getting dubbed Daps and hugs, mean mugs and shoulder shrugs And it's all because, accumulated enough stretch Just to navigate it, wood decorated on chrome And it's candy painted, fans fainted, while I'm entertaining Wild ain't it? How me and money end up hanging I hang with Hannibal Lector (hot shit!) so feel me when I bring it Sing it loud (what?) I'm from the Lou' and I'm proud Run a mile, for the cause, I'm righteous above the law Player my style's raw, I'm \"born to mack\" like Todd Shaw Forget the fame, and the glamor Give me d's with a rubber hammer My grammar be's ebonics, gin tonic and chronic Fuck bionic it's ironic, slamming niggas like onyx Lunatics til the day I die I run more game than the bulls and sonics [Chorus] Who say pretty boys can't be wild niggas? Loud niggas, o.k. corral niggas Foul niggas, run in the club and bust in the crowd nigga How nigga? ask me again and it's going down nigga Now nigga, come to the circus and watch me clown nigga Pound niggas, what you be giving when I'm around nigga Frown niggas, talking shit when I leave the town nigga Say now, can you hoes come out to play now Hey I'm, ready to cut you up any day now Play by, my rules boo and you gon' stay high May I, answer yo' third question like A.I. Say hi, to my niggas left in the slamma From St. Louis to Memphis From Texas back up to Indiana, Chi-town K.c. Motown to Alabama L.A., New York Yankee niggas to Hotlanta Louisiana, all my niggas wit \"country grammar\" Smoking blunts in Savannah Blow thirty mill' like I'm hammer [Chorus] Let's show these cats to make these millions So you niggas quit acting silly, mon Kid quicker than Billy, mon Talking really and I need it mon Foes I kick em freely mon, especially off remi, mon Keys to my beemer, mon, holla at Beenie Man See me, mon, cheifin' rolling deeper than any mon Through Jennings mon, through you-city back up to Kingsland Wit nice niggas, sheist niggas who snatch yo' life niggas Trife niggas, who produce and sell the same beat twice, nigga (hot shit!) Ice niggas, all over close to never sober From broke to having dough, cause my price range is rover Now I'm knocking like Jehovah, let me in now, let me in now Bill Gates, Donald Trump let me in now Spin now, I got money to lend my friends now We in now, candy Benz, Kenwood and ten inches now I win now (whoo!) fucking lesbian twins now Seeing now, through the pen I make my ends now [Chorus]",
    "language_code": "en",
    "completeness_heuristic": 1.0,
    "word_count": 526,
    "char_count": 2772,
    "sentence_count": 20,
    "type_token_ratio": 0.6083650190114068
  },
  "is_high_quality": false,
  "normalized_audio_path": "processed_dataset/MOOD/audio_rejected/009.wav"
}