{
  "track_id": "034",
  "provenance": {
    "original_audio_path": "../../data/raw/MIREX-like_mood/dataset/Audio/034.mp3",
    "original_lyrics_path": "../../data/raw/MIREX-like_mood/dataset/Lyrics/034.txt",
    "processing_date": "2025-10-24T22:16:42.868982+00:00",
    "script_version": "1.0.0"
  },
  "audio_properties": {
    "original_sr": 44100,
    "target_sr": 44100,
    "channels": 2
  },
  "audio_features": {
    "duration_seconds": 4.5351473922902495e-05,
    "integrated_loudness_lufs": -Infinity,
    "snr_percentile_db": 4.330877304077148,
    "clipping_percentage": 0.0,
    "rms_energy_mean": 6.657904577878071e-06,
    "rms_energy_std": 0.0,
    "zcr_mean": 0.0,
    "zcr_std": 0.0,
    "spectral_centroid_mean": 8650.246285189314,
    "spectral_bandwidth_mean": 5746.6327860312595,
    "mfcc_0_mean": -932.4266357421875,
    "mfcc_0_std": 0.0,
    "mfcc_1_mean": 20.07638931274414,
    "mfcc_1_std": 0.0,
    "mfcc_2_mean": -15.217100143432617,
    "mfcc_2_std": 0.0,
    "mfcc_3_mean": 10.892585754394531,
    "mfcc_3_std": 0.0,
    "mfcc_4_mean": -7.972639083862305,
    "mfcc_4_std": 0.0,
    "mfcc_5_mean": 5.8993635177612305,
    "mfcc_5_std": 0.0,
    "mfcc_6_mean": -4.538225173950195,
    "mfcc_6_std": 0.0,
    "mfcc_7_mean": 3.484201431274414,
    "mfcc_7_std": 0.0,
    "mfcc_8_mean": -2.8115904331207275,
    "mfcc_8_std": 0.0,
    "mfcc_9_mean": 2.1948037147521973,
    "mfcc_9_std": 0.0,
    "mfcc_10_mean": -1.8461920022964478,
    "mfcc_10_std": 0.0,
    "mfcc_11_mean": 1.4493913650512695,
    "mfcc_11_std": 0.0,
    "mfcc_12_mean": -1.2624088525772095,
    "mfcc_12_std": 0.0,
    "vocal_dominance_score_hpss": 0.5000000596046448
  },
  "lyrics_features": {
    "cleaned_text": "Your Butt Is Mine Gonna Take You Right Just Show Your Face In Broad Daylight I'm Telling You On How I Feel Gonna Hurt Your Mind Don't Shoot To Kill Come On, Come On, Lay It On Me All Right... I'm Giving You On Count Of Three To Show Your Stuff Or Let It Be . . . I'm Telling You Just Watch Your Mouth I Know Your Game What You're About Well They Say The Sky's The Limit And To Me That's Really True But My Friend You Have Seen Nothing Just Wait 'Til I Get Through . . . Because I'm Bad, I'm Bad- Come On (Bad Bad-Really, Really Bad) You Know I'm Bad, I'm Bad- You Know It (Bad Bad-Really, Really Bad) You Know I'm Bad, I'm Bad- Come On, You Know (Bad Bad-Really, Really Bad) And The Whole World Has To Answer Right Now Just To Tell You Once Again, Who's Bad . . . The Word Is Out You're Doin' Wrong Gonna Lock You Up Before Too Long, Your Lyin' Eyes Gonna Take You Right So Listen Up Don't Make A Fight, Your Talk Is Cheap You're Not A Man You're Throwin' Stones To Hide Your Hands But They Say The Sky's The Limit And To Me That's Really True And My Friends You Have Seen Nothin' Just Wait 'Til I Get Through . . . Because I'm Bad, I'm Bad- Come On (Bad Bad-Really, Really Bad) You Know I'm Bad, I'm Bad- You Know It (Bad Bad-Really, Really Bad) You Know I'm Bad, I'm Bad- You Know It, You Know (Bad Bad-Really, Really Bad) And The Whole World Has To Answer Right Now (And The Whole World Has To Answer Right Now) Just To Tell You Once Again, (Just To Tell You Once Again) Who's Bad . . . We Can Change The World Tomorrow This Could Be A Better Place If You Don't Like What I'm Sayin' Then Won't You Slap My Face . . . Because I'm Bad, I'm Bad- Come On (Bad Bad-Really, Really Bad) You Know I'm Bad, I'm Bad- You Know It (Bad Bad-Really, Really Bad) You Know I'm Bad, I'm Bad- You Know It, You Know (Bad Bad-Really, Really Bad) Woo! Woo! Woo! (And The Whole World Has To Answer Right Now Just To Tell You Once Again . . .) You Know I'm Bad, I'm Bad- Come On (Bad Bad-Really, Really Bad) You Know I'm Bad, I'm Bad- You Know It-You Know It (Bad Bad-Really, Really Bad) You Know, You Know, You Know, Come On (Bad Bad-Really, Really Bad) And The Whole World Has To Answer Right Now (And The Whole World Has To Answer Right Now) Just To Tell You (Just To Tell You Once Again) You Know I'm Smooth, I'm Bad, You Know It (Bad Bad-Really, Really Bad) You Know I'm Bad, I'm Bad Baby (Bad Bad-Really, Really Bad) You Know, You Know, You Know It, Come On (Bad Bad-Really, Really Bad) And The Whole World Has To Answer Right Now (And The Whole World Has To Answer Right Now) Woo! (Just To Tell You Once Again) You Know I'm Bad, I'm Bad- You Know It (Bad Bad-Really, Really Bad) You Know I'm Bad-You Know-Hoo! (Bad Bad-Really, Really Bad) You Know I'm Bad-I'm Bad- You Know It, You Know (Bad Bad-Really, Really Bad) And The Whole World Has To Answer Right Now (And The Whole World Has To Answer Right Now) Just To Tell You Once Again . . . (Just To Tell You Once Again . . .) Who's Bad?",
    "language_code": "en",
    "completeness_heuristic": 0.8,
    "word_count": 596,
    "char_count": 2973,
    "sentence_count": 35,
    "type_token_ratio": 0.23657718120805368
  },
  "is_high_quality": false,
  "normalized_audio_path": "processed_dataset/MOOD/audio_rejected/034.wav"
}