{
  "track_id": "277",
  "provenance": {
    "original_audio_path": "../../data/raw/MIREX-like_mood/dataset/Audio/277.mp3",
    "original_lyrics_path": "../../data/raw/MIREX-like_mood/dataset/Lyrics/277.txt",
    "processing_date": "2025-10-24T22:16:43.550293+00:00",
    "script_version": "1.0.0"
  },
  "audio_properties": {
    "original_sr": 44100,
    "target_sr": 44100,
    "channels": 2
  },
  "audio_features": {
    "duration_seconds": 4.5351473922902495e-05,
    "integrated_loudness_lufs": -Infinity,
    "snr_percentile_db": 3.318072557449341,
    "clipping_percentage": 0.0,
    "rms_energy_mean": 1.0256505902361823e-06,
    "rms_energy_std": 0.0,
    "zcr_mean": 0.00048828125,
    "zcr_std": 0.0,
    "spectral_centroid_mean": 13597.918214724868,
    "spectral_bandwidth_mean": 5625.63432305395,
    "mfcc_0_mean": -1128.0880126953125,
    "mfcc_0_std": 0.0,
    "mfcc_1_mean": -4.526813507080078,
    "mfcc_1_std": 0.0,
    "mfcc_2_mean": 4.1921491622924805,
    "mfcc_2_std": 0.0,
    "mfcc_3_mean": -3.675208568572998,
    "mfcc_3_std": 0.0,
    "mfcc_4_mean": 3.0310323238372803,
    "mfcc_4_std": 0.0,
    "mfcc_5_mean": -2.325376033782959,
    "mfcc_5_std": 0.0,
    "mfcc_6_mean": 1.6256530284881592,
    "mfcc_6_std": 0.0,
    "mfcc_7_mean": -0.9921005368232727,
    "mfcc_7_std": 0.0,
    "mfcc_8_mean": 0.47053617238998413,
    "mfcc_8_std": 0.0,
    "mfcc_9_mean": -0.0876348465681076,
    "mfcc_9_std": 0.0,
    "mfcc_10_mean": -0.15035265684127808,
    "mfcc_10_std": 0.0,
    "mfcc_11_mean": 0.2560248374938965,
    "mfcc_11_std": 0.0,
    "mfcc_12_mean": -0.2563728988170624,
    "mfcc_12_std": 0.0,
    "vocal_dominance_score_hpss": 0.4999999403953552
  },
  "lyrics_features": {
    "cleaned_text": "Truckin' got my chips cashed in. Keep truckin', like the do-dah man Together, more or less in line, just keep truckin' on. Arrows of neon and flashing marquees out on Main Street. Chicago, New York, Detroit and it's all on the same street. Your typical city involved in a typical daydream Hang it up and see what tomorrow brings. Dallas, got a soft machine; Houston, too close to New Orleans, New York's got the ways and means; but just won't let you be, oh no. Most of the cats that you meet on the streets speak of true love, Most of the time they're sittin' and cryin' at home. One of these days they know they better get goin' Out of the door and down on the streets all alone. Truckin', like the do-dah man. Once told me \"You've got to play your hand\" Sometimes your cards ain't worth a dime, if you don't lay'em down, Sometimes the light's all shinin' on me, Other times I can barely see. Lately it occurs to me what a long, strange trip it's been. What in the world ever became of sweet Jane? She lost her sparkle, you know she isn't the same Livin' on reds, vitamin see, and cocaine, All a friend can say is \"Ain't it a shame?\" Truckin', up to Buffalo. Been thinkin', you got to mellow slow Takes time, you pick a place to go, and just keep truckin' on. Sittin' and starin' out of the hotel window. Got a tip they're gonna kick the door in again I'd like to get some sleep before I travel, But if you got a warrant, I guess you're gonna come in. Busted, down on Bourbon Street, set up, like a bowlin' pin. Knocked down, it get's to wearin' thin. They just won't let you be, oh no. You're sick of hangin' around and you'd like to travel, Get tired of travelin' and you want to settle down. I guess they can't revoke your soul for tryin', Get out of the door and light out and look all around. Sometimes the light's all shinin' on me, Other times I can barely see. Lately it occurs to me what a long, strange trip it's been. Truckin', I'm a goin' home. Whoa whoa baby, back where I belong, Back home, sit down and patch my bones, and get back truckin' on. Hey now get back truckin' home.",
    "language_code": "en",
    "completeness_heuristic": 1.0,
    "word_count": 403,
    "char_count": 2093,
    "sentence_count": 28,
    "type_token_ratio": 0.5632754342431762
  },
  "is_high_quality": false,
  "normalized_audio_path": "processed_dataset/MOOD/audio_rejected/277.wav"
}