{
  "track_id": "558",
  "provenance": {
    "original_audio_path": "../../data/raw/MIREX-like_mood/dataset/Audio/558.mp3",
    "original_lyrics_path": "../../data/raw/MIREX-like_mood/dataset/Lyrics/558.txt",
    "processing_date": "2025-10-24T22:16:42.942385+00:00",
    "script_version": "1.0.0"
  },
  "audio_properties": {
    "original_sr": 44100,
    "target_sr": 44100,
    "channels": 2
  },
  "audio_features": {
    "duration_seconds": 4.5351473922902495e-05,
    "integrated_loudness_lufs": -Infinity,
    "snr_percentile_db": 3.8578989505767822,
    "clipping_percentage": 0.0,
    "rms_energy_mean": 3.806311497100978e-07,
    "rms_energy_std": 0.0,
    "zcr_mean": 0.0,
    "zcr_std": 0.0,
    "spectral_centroid_mean": 8556.899110104941,
    "spectral_bandwidth_mean": 5691.45792857509,
    "mfcc_0_mean": -1131.370849609375,
    "mfcc_0_std": 0.0,
    "mfcc_1_mean": 0.0,
    "mfcc_1_std": 0.0,
    "mfcc_2_mean": 0.0,
    "mfcc_2_std": 0.0,
    "mfcc_3_mean": 0.0,
    "mfcc_3_std": 0.0,
    "mfcc_4_mean": 0.0,
    "mfcc_4_std": 0.0,
    "mfcc_5_mean": 0.0,
    "mfcc_5_std": 0.0,
    "mfcc_6_mean": 0.0,
    "mfcc_6_std": 0.0,
    "mfcc_7_mean": 0.0,
    "mfcc_7_std": 0.0,
    "mfcc_8_mean": 0.0,
    "mfcc_8_std": 0.0,
    "mfcc_9_mean": 0.0,
    "mfcc_9_std": 0.0,
    "mfcc_10_mean": 0.0,
    "mfcc_10_std": 0.0,
    "mfcc_11_mean": 0.0,
    "mfcc_11_std": 0.0,
    "mfcc_12_mean": 0.0,
    "mfcc_12_std": 0.0,
    "vocal_dominance_score_hpss": 0.5
  },
  "lyrics_features": {
    "cleaned_text": "On a hot summer night would you offer your throat to the wolf with the red roses? Will he offer me his mouth? Yes Will he offer me his teeth? Yes Will he offer me his jaws? Yes Will he offer me his hunger? Yes Again, will he offer me his hunger? Yes! And will he starve without me? Yes! And does he love me? Yes Yes On a hot summer night would you offer your throat to the wolf with the red roses? Yes I bet you to say that to all the boys. It was a hot summer night and the beach was burning There was fog crawling over the sand When I listened to your heart I hear the whole world turning I see the shooting stars Falling through your trembling hands You were licking your lips and your lipstick shining I was dying just to ask for a taste We were lying together in a silver lining By the light of the moon You know there's not another moment Not another moment Not another moment to waste When you hold me so close that my knees grow weak And my soul is flying high above the ground I'm trying to speak but no matter what I do I just can't seem to make any sound And then you took the words right out of my mouth Oh it must have been while you were kissing me You took the words right out of my mouth And I swear it's true I was just about to say I love you And then you took the words right out of my mouth Oh it must have been while you were kissing me You took the words right out of my mouth And I swear it's true I was just about to say I love you Now my body is shaking like a wave on the water And I guess that I'm beginning to grin Oh, we're finally alone and we can do what we want to The night is young And ain't no one gonna know where you No one gonna know where you No one's gonna know where you've been You were licking your lips and your lipstick shining I was dying just to ask for a taste We were lying together in a silver lining By the light of the moon You know there's not another moment Not another moment Not another moment to waste And then you took the words right out of my mouth Oh it must have been while you were kissing me",
    "language_code": "en",
    "completeness_heuristic": 1.0,
    "word_count": 430,
    "char_count": 2055,
    "sentence_count": 13,
    "type_token_ratio": 0.3744186046511628
  },
  "is_high_quality": false,
  "normalized_audio_path": "processed_dataset/MOOD/audio_rejected/558.wav"
}