{
  "track_id": "623",
  "provenance": {
    "original_audio_path": "../../data/raw/MIREX-like_mood/dataset/Audio/623.mp3",
    "original_lyrics_path": "../../data/raw/MIREX-like_mood/dataset/Lyrics/623.txt",
    "processing_date": "2025-10-24T22:16:39.223545+00:00",
    "script_version": "1.0.0"
  },
  "audio_properties": {
    "original_sr": 44100,
    "target_sr": 44100,
    "channels": 2
  },
  "audio_features": {
    "duration_seconds": 4.5351473922902495e-05,
    "integrated_loudness_lufs": -Infinity,
    "snr_percentile_db": 12.144165992736816,
    "clipping_percentage": 0.0,
    "rms_energy_mean": 1.7421822349206195e-06,
    "rms_energy_std": 0.0,
    "zcr_mean": 0.0,
    "zcr_std": 0.0,
    "spectral_centroid_mean": 9943.62125593722,
    "spectral_bandwidth_mean": 6249.765221415108,
    "mfcc_0_mean": -1068.6239013671875,
    "mfcc_0_std": 0.0,
    "mfcc_1_mean": 9.738602638244629,
    "mfcc_1_std": 0.0,
    "mfcc_2_mean": -6.792026519775391,
    "mfcc_2_std": 0.0,
    "mfcc_3_mean": 4.239250183105469,
    "mfcc_3_std": 0.0,
    "mfcc_4_mean": -2.714700222015381,
    "mfcc_4_std": 0.0,
    "mfcc_5_mean": 1.6991493701934814,
    "mfcc_5_std": 0.0,
    "mfcc_6_mean": -1.1527982950210571,
    "mfcc_6_std": 0.0,
    "mfcc_7_mean": 0.7300050854682922,
    "mfcc_7_std": 0.0,
    "mfcc_8_mean": -0.5538455843925476,
    "mfcc_8_std": 0.0,
    "mfcc_9_mean": 0.331251859664917,
    "mfcc_9_std": 0.0,
    "mfcc_10_mean": -0.2979072332382202,
    "mfcc_10_std": 0.0,
    "mfcc_11_mean": 0.15588797628879547,
    "mfcc_11_std": 0.0,
    "mfcc_12_mean": -0.1758384257555008,
    "mfcc_12_std": 0.0,
    "vocal_dominance_score_hpss": 0.5000000596046448
  },
  "lyrics_features": {
    "cleaned_text": "(Reporter): Hello, everyone, this is your action news reporter with all the news that is news across the nation, on the scene at the supermarket. There seems to have been some disturbance here. Pardon me, sir, did you see what happened? (Witness): Yeah, I did. I's standin' overe there by the tomaters, and here he come, running through the pole beans, through the fruits and vegetables, nekkid as a jay bird. And I hollered over t' Ethel, I said, \"Don't look, Ethel!\" But it's too late, she'd already been incensed. (Chorus) Here he comes, look at that, look at that There he goes, look at that, look at that And he ain't wearin' no clothes Oh, yes, they call him the Streak Look at that, look at that Fastest thing on two feet Look at that, look at that He's just as proud as he can be Of his anatomy He goin' give us a peek Oh, yes, they call him the Streak Look at that, look at that He likes to show off his physique Look at that, look at that If there's an audience to be found He'll be streakin' around Invitin' public critique (Reporter): This is your action news reporter once again, and we're here at the gas station. Pardon me, sir, did you see what happened? (Witness): Yeah, I did. I's just in here gettin my car checked, he just appeared out of the traffic. Come streakin' around the grease rack there, didn't have nothin' on but a smile. I looked in there, and Ethel was gettin' her a cold drink. I hollered, \"Don't look, Ethel!\" But it was too late. She'd already been mooned. Flashed her right there in front of the shock absorbers. (Chorus) He ain't crude, look at that, look at that He ain't lewd, look at that, look at that He's just in the mood to run in the nude Oh, yes, they call him the Streak Look at that, look at that He likes to turn the other cheek Look at that, look at that He's always makin' the news Wearin' just his tennis shoes Guess you could call him unique (Reporter): Once again, your action news reporter in the booth at the gym, covering the disturbance at the basketball playoff. Pardon me, sir, did you see what happened? (Witness): Yeah, I did. Half time, I's just goin' down thar to get Ethel a snow cone. And here he come, right out of the cheap seats, dribbling, right down the middle of the court. Didn't have on nothing but his PF's. Made a hook shot and got out through the concessions stand. I hollered up at Ethel, I said, \"Don't look, Ethel!\" But it was too late. She'd already got a free shot. Grandstandin', right there in front of the home team. (Chorus) (Witness): Oh, yes, they call him the Streak Here he comes again. Look at that, look at that Who's that with him? The fastest thing on two feet Ethel? Is that you, Ethel? Look at that, look at that What do you think you're He's just as proud as he can be doin'? You git your Of his anatomy clothes on! He's gonna give us a peek Oh, yes, they call him the Streak Ethel! Where you goin'? Look at that, look at that Ethel, you shameless He likes to show off his physique hussy! Say it isn't so, Look at that, look at that Ethel! Ethelllllll!!! If there's an audience to be found He'll be streakin' around Invitin' public critique",
    "language_code": "en",
    "completeness_heuristic": 1.0,
    "word_count": 593,
    "char_count": 3138,
    "sentence_count": 40,
    "type_token_ratio": 0.40640809443507586
  },
  "is_high_quality": true,
  "normalized_audio_path": "processed_dataset/MOOD/audio_normalized/623.wav"
}