{
  "track_id": "786",
  "provenance": {
    "original_audio_path": "../../data/raw/MIREX-like_mood/dataset/Audio/786.mp3",
    "original_lyrics_path": "../../data/raw/MIREX-like_mood/dataset/Lyrics/786.txt",
    "processing_date": "2025-10-24T22:16:37.389528+00:00",
    "script_version": "1.0.0"
  },
  "audio_properties": {
    "original_sr": 44100,
    "target_sr": 44100,
    "channels": 2
  },
  "audio_features": {
    "duration_seconds": 4.5351473922902495e-05,
    "integrated_loudness_lufs": -Infinity,
    "snr_percentile_db": 0.09541240334510803,
    "clipping_percentage": 0.0,
    "rms_energy_mean": 3.2924833703873446e-06,
    "rms_energy_std": 0.0,
    "zcr_mean": 0.0,
    "zcr_std": 0.0,
    "spectral_centroid_mean": 8007.562929058591,
    "spectral_bandwidth_mean": 5285.948736518147,
    "mfcc_0_mean": -1001.2404174804688,
    "mfcc_0_std": 0.0,
    "mfcc_1_mean": 23.346290588378906,
    "mfcc_1_std": 0.0,
    "mfcc_2_mean": -18.03390884399414,
    "mfcc_2_std": 0.0,
    "mfcc_3_mean": 13.247027397155762,
    "mfcc_3_std": 0.0,
    "mfcc_4_mean": -9.916420936584473,
    "mfcc_4_std": 0.0,
    "mfcc_5_mean": 7.488600730895996,
    "mfcc_5_std": 0.0,
    "mfcc_6_mean": -5.818844795227051,
    "mfcc_6_std": 0.0,
    "mfcc_7_mean": 4.495960235595703,
    "mfcc_7_std": 0.0,
    "mfcc_8_mean": -3.5880913734436035,
    "mfcc_8_std": 0.0,
    "mfcc_9_mean": 2.7653627395629883,
    "mfcc_9_std": 0.0,
    "mfcc_10_mean": -2.2366905212402344,
    "mfcc_10_std": 0.0,
    "mfcc_11_mean": 1.682741403579712,
    "mfcc_11_std": 0.0,
    "mfcc_12_mean": -1.3591217994689941,
    "mfcc_12_std": 0.0,
    "vocal_dominance_score_hpss": 0.5000002384185791
  },
  "lyrics_features": {
    "cleaned_text": "Jesus died for somebody's sins but not mine Meltin' in a pot of thieves Wild card up my sleeve Thick heart of stone My sins my own They belong to me, me People say beware! But I don't care The words are just Rules and regulations to me, me I-I walk in a room, you know I look so proud I'm movin' in this here atmosphere, where anything's allowed And I go to this here party and I just get bored Until I look out the window, see a sweet young thing Humpin' on the parking meter, leanin' on the parking meter Oh, she looks so good, oh, she looks so fine And I got this crazy feeling and then I'm gonna ah-ah make her mine Ooh I'll put my spell on her Here she comes Walkin' down the street Here she comes Comin' through my door Here she comes Crawlin' up my stair Here she comes Waltzin' through the hall In a pretty red dress And oh, she looks so good, oh, she looks so fine And I got this crazy feeling that I'm gonna ah-ah make her mine And then I hear this knockin' on my door Hear this knockin' on my door And I look up into the big tower clock And say, \"Oh my God, here's midnight!\" And my baby is walkin' through the door Leanin' on my couch she whispers to me and I take the big plunge And oh, she was so good and oh, she was so fine And I'm gonna tell the world that I just ah-ah made her mine And I said darling, tell me your name, she told me her name She whispered to me, she told me her name And her name is, and her name is, and her name is, and her name is G-L-O-R-I-A G-L-O-R-I-A Gloria G-L-O-R-I-A Gloria G-L-O-R-I-A Gloria G-L-O-R-I-A Gloria I was at the stadium There were twenty thousand girls called their names out to me Marie and Ruth but to tell you the truth I didn't hear them I didn't see I let my eyes rise to the big tower clock And I heard those bells chimin' in my heart Going ding dong ding dong ding dong ding dong. Ding dong ding dong ding dong ding dong Counting the time, then you came to my room And you whispered to me and we took the big plunge And oh. You were so good, oh, you were so fine And I gotta tell the world that I make her mine make her mine Make her mine make her mine make her mine make her mine G-L-O-R-I-A Gloria G-L-O-R-I-A Gloria G-L-O-R-I-A Gloria, G-L-O-R-I-A Gloria And the tower bells chime, \"ding dong\" they chime They're singing, \"Jesus died for somebody's sins but not mine.\" Gloria G-L-O-R-I-A Gloria G-L-O-R-I-A Gloria G-L-O-R-I-A, Gloria G-L-O-R-I-A, G-L-O-R-I-A Gloria G-L-O-R-I-A Gloria G-L-O-R-I-A Gloria G-L-O-R-I-A Gloria G-L-O-R-I-A Gloria, G-L-O-R-I-A Gloria G-L-O-R-I-A Gloria G-L-O-R-I-A Gloria, G-L-O-R-I-A Gloria G-L-O-R-I-A Gloria G-L-O-R-I-A Gloria.",
    "language_code": "en",
    "completeness_heuristic": 1.0,
    "word_count": 497,
    "char_count": 2627,
    "sentence_count": 7,
    "type_token_ratio": 0.3983903420523139
  },
  "is_high_quality": false,
  "normalized_audio_path": "processed_dataset/MOOD/audio_rejected/786.wav"
}