{
  "track_id": "807",
  "provenance": {
    "original_audio_path": "../../data/raw/MIREX-like_mood/dataset/Audio/807.mp3",
    "original_lyrics_path": "../../data/raw/MIREX-like_mood/dataset/Lyrics/807.txt",
    "processing_date": "2025-10-24T22:16:43.910692+00:00",
    "script_version": "1.0.0"
  },
  "audio_properties": {
    "original_sr": 44100,
    "target_sr": 44100,
    "channels": 2
  },
  "audio_features": {
    "duration_seconds": 4.5351473922902495e-05,
    "integrated_loudness_lufs": -Infinity,
    "snr_percentile_db": 4.086307525634766,
    "clipping_percentage": 0.0,
    "rms_energy_mean": 6.178080184326973e-06,
    "rms_energy_std": 0.0,
    "zcr_mean": 0.0,
    "zcr_std": 0.0,
    "spectral_centroid_mean": 8601.862708261468,
    "spectral_bandwidth_mean": 5718.424691038126,
    "mfcc_0_mean": -939.7838134765625,
    "mfcc_0_std": 0.0,
    "mfcc_1_mean": 20.47956085205078,
    "mfcc_1_std": 0.0,
    "mfcc_2_mean": -15.574079513549805,
    "mfcc_2_std": 0.0,
    "mfcc_3_mean": 11.203287124633789,
    "mfcc_3_std": 0.0,
    "mfcc_4_mean": -8.243141174316406,
    "mfcc_4_std": 0.0,
    "mfcc_5_mean": 6.135903358459473,
    "mfcc_5_std": 0.0,
    "mfcc_6_mean": -4.745771408081055,
    "mfcc_6_std": 0.0,
    "mfcc_7_mean": 3.6669397354125977,
    "mfcc_7_std": 0.0,
    "mfcc_8_mean": -2.972890615463257,
    "mfcc_8_std": 0.0,
    "mfcc_9_mean": 2.337496280670166,
    "mfcc_9_std": 0.0,
    "mfcc_10_mean": -1.9726719856262207,
    "mfcc_10_std": 0.0,
    "mfcc_11_mean": 1.5617189407348633,
    "mfcc_11_std": 0.0,
    "mfcc_12_mean": -1.362345814704895,
    "mfcc_12_std": 0.0,
    "vocal_dominance_score_hpss": 0.5
  },
  "lyrics_features": {
    "cleaned_text": "Killing in the name of! Some of those that work forces are the same that burn crosses Some of those that work forces are the same that burn crosses Some of those that work forces are the same that burn crosses Some of those that work forces are the same that burn crosses Huh! Killing in the name of! Killing in the name of And now you do what they told ya And now you do what they told ya And now you do what they told ya And now you do what they told ya And now you do what they told ya And now you do what they told ya And now you do what they told ya And now you do what they told ya And now you do what they told ya And now you do what they told ya And now you do what they told ya But now you do what they told ya Well now you do what they told ya Those who died are justified, for wearing the badge, they're the chosen whites You justify those that died by wearing the badge, they're the chosen whites Those who died are justified, for wearing the badge, they're the chosen whites You justify those that died by wearing the badge, they're the chosen whites Some of those that work forces are the same that burn crosses Some of those that work forces are the same that burn crosses Some of those that work forces are the same that burn crosses Some of those that work forces are the same that burn crosses Uggh! Killing in the name of! Killing in the name of And now you do what they told ya And now you do what they told ya And now you do what they told ya And now you do what they told ya And now you do what they told ya, now you're under control And now you do what they told ya, now you're under control And now you do what they told ya, now you're under control And now you do what they told ya, now you're under control And now you do what they told ya, now you're under control And now you do what they told ya, now you're under control And now you do what they told ya, now you're under control And now you do what they told ya! Those who died are justified, for wearing the badge, they're the chosen whites You justify those that died by wearing the badge, they're the chosen whites Those who died are justified, for wearing the badge, they're the chosen whites You justify those that died by wearing the badge, they're the chosen whites Come on! Yeah! Come on! Fuck you, I won't do what you tell me Fuck you, I won't do what you tell me Fuck you, I won't do what you tell me Fuck you, I won't do what you tell me Fuck you, I won't do what you tell me Fuck you, I won't do what you tell me Fuck you, I won't do what you tell me Fuck you, I won't do what you tell me Fuck you, I won't do what you tell me! Fuck you, I won't do what you tell me! Fuck you, I won't do what you tell me! Fuck you, I won't do what you tell me! Fuck you, I won't do what you tell me! Fuck you, I won't do what you tell me! Fuck you, I won't do what you tell me! Fuck you, I won't do what you tell me! Motherfucker! Uggh!",
    "language_code": "en",
    "completeness_heuristic": 1.0,
    "word_count": 606,
    "char_count": 2913,
    "sentence_count": 20,
    "type_token_ratio": 0.0924092409240924
  },
  "is_high_quality": false,
  "normalized_audio_path": "processed_dataset/MOOD/audio_rejected/807.wav"
}